[ {
  "author" : "yyysss",
  "name" : "2 года живу без лени",
  "realise" : "Sun Jan 26 18:11:53 MSK 2025",
  "timeToRead" : "5 мин",
  "views" : 712,
  "imgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/fa0/598/303/fa0598303338e5bce514707bcdf194db.jpg",
  "rubriks" : [ "Управление персоналом*" ],
  "prehedder" : "Я два года живу без лени. Как я этого добился и как выглядит моя жизнь? Последние годы я активно изучаю разные механизмы психики:"
}, {
  "author" : "aaplpro",
  "name" : "Apple Pro Weekly News (02.12 – 08.12.24)",
  "realise" : "Sun Jan 26 17:44:43 MSK 2025",
  "timeToRead" : "18 мин",
  "views" : 204,
  "imgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/c44/21c/a6b/c4421ca6b9273159dfb65a3473d46ed5.jpeg",
  "rubriks" : [ "IT-компании", "Компьютерное железо", "Гаджеты", "Смартфоны" ],
  "prehedder" : "Выходит в общедоступный релиз iOS 18.2 и macOS 15.2 Sequoia – что там нового? Тим Кук дал интервью, а также объявил об открытии магазинов в новой стране. Через что разработчики смогут писать на Swift даже для Android, а когда App Store будет медленно модерировать приложения? Как сгибаемый iPhone может оживить рынок, когда же выйдет первый iPhone с 5G-модемом от Apple и будет ли MacBook с сотовым модулем? Эти и другие слухи, а также другие важные события недели – в нашем свежем яблочном дайджесте, приглашаем к прочтению!"
}, {
  "author" : "LegalDesignWK",
  "name" : "Formacion Profesional Grado Superior DAW обучение на разработчика в Испании",
  "realise" : "Sun Jan 26 17:21:08 MSK 2025",
  "timeToRead" : "3 мин",
  "views" : 124,
  "imgAddress" : "",
  "rubriks" : [ "Образование за рубежом", "Разработка мобильных приложений*", "Тестирование веб-сервисов*" ],
  "prehedder" : ""
}, {
  "author" : "morett1m",
  "name" : "Rust без прикрас: где мы продолжаем ошибаться",
  "realise" : "Sun Jan 26 16:12:50 MSK 2025",
  "timeToRead" : "8 мин",
  "views" : 668,
  "imgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/7fb/979/010/7fb9790100f919c9395b9ac538931e23.jpg",
  "rubriks" : [ "Блог компании Beget", "Rust*", "Программирование*" ],
  "prehedder" : "Привет, Хабр! В предыдущей статье мы разобрали, как не ломать себе карьеру, бездумно используя unwrap() или игнорируя ошибки через let _ =. Но давайте честно: это были цветочки. Настоящие проблемы начинаются там, где ваш код работает «почти идеально», а потом, под грохот продакшена, вы осознаете, что все было далеко не так гладко. Сегодня вторая часть. Разберем несколько ошибок, которые выглядят безобидно, но тащат за собой баги, утечки памяти и необъяснимые фризы. Начнем с первой проблемы при работе с .iter() и .iter_mut."
}, {
  "author" : "Kaspersky_Lab",
  "name" : "Security Week 2450: бэкдор в SDK для блокчейн-платформы Solana",
  "realise" : "Sun Jan 26 14:21:39 MSK 2025",
  "timeToRead" : "3 мин",
  "views" : 319,
  "imgAddress" : "",
  "rubriks" : [ "Блог компании «Лаборатория Касперского»", "Информационная безопасность*" ],
  "prehedder" : ""
}, {
  "author" : "Drymonade",
  "name" : "Гайд по созданию аналитического сервиса: от идеи до реализации",
  "realise" : "Sun Jan 26 16:17:03 MSK 2025",
  "timeToRead" : "10 мин",
  "views" : 218,
  "imgAddress" : "https://habrastorage.org/r/w1560/getpro/habr/upload_files/21a/aad/ba1/21aaadba1386efa3b239e13eb0369ffb.png",
  "rubriks" : [ "Блог компании Учи.ру team" ],
  "prehedder" : "Привет, меня зовут Андрей, и я Python-разработчик образовательной платформы Учи.ру. Как и во многих компаниях, у нас есть потребность в регулярной аналитике. Часть данных анализируется в специализированных BI-системах или обрабатывается аналитиками вручную. Но иногда возникает необходимость в создании автоматизированного отчета со специфичными параметрами, удобным интерфейсом и возможностью частого обновления. В таких случаях мы разрабатываем отдельные веб-сервисы. За время работы я написал несколько подобных сервисов, которые во многом похожи. В этом гайде я поделюсь опытом построения таких решений, ориентируясь на коллег уровня junior или middle. В этом проекте мы будем использовать Django для бэкенда и React для фронтенда."
}, {
  "author" : "CyberexTech",
  "name" : "Зачем покупать, когда можно… или как я собирал систему мониторинга фильтра воды и что из этого вышло",
  "realise" : "Sun Jan 26 14:05:32 MSK 2025",
  "timeToRead" : "9 мин",
  "views" : 21000,
  "imgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/708/a9e/492/708a9e492c09fe105c379152df02d7cf.jpg",
  "rubriks" : [ "Блог компании Timeweb Cloud", "DIY или Сделай сам", "C++*", "Разработка под Android*", "Разработка под Arduino*" ],
  "prehedder" : "Привет, Хабр! Наверное, многие из вас понимают, насколько важно качество питьевой воды для здоровья человека. Технологии не стоят на месте и высокотехнологичные решения очистки воды, которые когда-то казались фантастикой, теперь доступны и для бытового применения за небольшие деньги. Речь идет о фильтре, работающего на принципе обратного осмоса, который позволяет получать питьевую воду высокого качества даже из самых загрязненных источников. В этой статье я расскажу о своем опыте разработки системы мониторинга для бытового фильтра воды и что в итоге из этого получилось."
}, {
  "author" : "ivan_storozhev",
  "name" : "Защита своего приложения с помощью JWT и Spring Security",
  "realise" : "Sun Jan 26 18:50:12 MSK 2025",
  "timeToRead" : "42 мин",
  "views" : 172,
  "imgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/36c/796/df1/36c796df15f936d6277db550e4a7e00a.jpg",
  "rubriks" : [ "Программирование*", "Java*" ],
  "prehedder" : "В прошлой статье мы познакомились с такой технологией как Keycloak. Если говорить вкратце, то Keycloak это технология, которая помогает реализовать безопасность для вашего приложения. Он автоматически генерирует JWT и предлагает готовые решения для безопасности, что упрощает работу для разработчика. Но бывает так, что встроенной генерации JWT не достаточно или она не совсем подходит, тогда нужно создать свою реализацию данного токена. В данной статье мы рассмотрим как реализовать простую генерацию своего JWT."
}, {
  "author" : "NeyroEntuziast",
  "name" : "ИИ-генератор видео Sora от OpenAI теперь доступен всем желающим",
  "realise" : "Sun Jan 26 18:48:08 MSK 2025",
  "timeToRead" : "2 мин",
  "views" : 175,
  "imgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/937/a95/0f1/937a950f13a9d66617f547fc93a103c7.jpg",
  "rubriks" : [ "Искусственный интеллект" ],
  "prehedder" : "Компания OpenAI выложила в открытый доступ видеогенератор Sora AI, включая некоторые инструменты, помогающие авторам создавать сложные проекты. Долго разрабатываемая модель позволяет генерировать короткие видеоклипы на основе текстовых подсказок. Однако с помощью дополнительных промптов можно в той или иной степени «ремиксировать» промпты, а с помощью раскадровки можно объединить несколько промптов и создать переходы между роликами."
}, {
  "author" : "MMadmer",
  "name" : "Кастомная сериализация структур в UE",
  "realise" : "Sun Jan 26 17:55:36 MSK 2025",
  "timeToRead" : "3 мин",
  "views" : 128,
  "imgAddress" : "https://habrastorage.org/r/w1560/getpro/habr/upload_files/d72/f27/880/d72f278809db7ad37cc8ca8f99d8b170.png",
  "rubriks" : [ "Unreal Engine*", "C++*", "Разработка игр*" ],
  "prehedder" : "Допустим, вы создали свою USTRUCT в C++ и хотите её сериализовать. Обычно, достаточно просто пометить нужные поля как SaveGame. Но вот проблема, для этого эти поля сами должны поддерживать сериализацию. К сожалению одна из наших переменных не поддерживает сериализацию. В моем случае, это структура FNonSerializableStruct. Из-за этого сериализуется только вторая структура, хоть мы и пометили SaveGame обе."
}, {
  "author" : "moiseeva",
  "name" : "МФТИ жжëт… керосины",
  "realise" : "Sun Jan 26 14:43:32 MSK 2025",
  "timeToRead" : "4 мин",
  "views" : 13000,
  "imgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/54c/c62/e08/54cc62e08ce0167ba5eaa40389695cf4.jpg",
  "rubriks" : [ "Блог компании Московский физико-технический институт (МФТИ)", "Физика", "Научно-популярное", "Космонавтика" ],
  "prehedder" : "МФТИ жжёт... керосины: Кафедра физической механики МФТИ и ЦИАМ применяют забытые методы для современных задач авиации При проектировании двигателя особое место уделяется камере сгорания, так как именно в ней осуществляется превращение химической энергии горючей смеси в кинетическую энергию продуктов сгорания, что и позволяет двигателю совершать полезную работу. О том, как идет работа над созданием уникальной ударной трубы для испытаний углеводородной смеси и какие задачи решает такой экспериментальный стенд - в прямой речи команды проекта."
}, {
  "author" : "neuromancertdi",
  "name" : "Машинное обучение: Логистическая регрессия. Теория и реализация. С нуля",
  "realise" : "Sun Jan 26 15:00:40 MSK 2025",
  "timeToRead" : "12 мин",
  "views" : 293,
  "imgAddress" : "https://habrastorage.org/r/w1560/getpro/habr/upload_files/e8c/a5c/081/e8ca5c081745e20fa8a0f9534d506da9.png",
  "rubriks" : [ "Машинное обучение*", "Искусственный интеллект", "Программирование*", "Алгоритмы*", "Python*" ],
  "prehedder" : "В этой статье я привел базовые сведения о логистической регрессии и показал как сделать модель с нуля на чистом Python. Логистическая функция, обучение, метрики качества для модели классификации, реализация и небольшой разбор обучения весов. Статья подойдет для того, кто новичок или кому интересно разобраться в том, как происходит обучение модели на низком уровне."
}, {
  "author" : "cemick",
  "name" : "От Trello к Obsidian: шаблон для управления проектами в стиле scrum",
  "realise" : "Sun Jan 26 15:00:43 MSK 2025",
  "timeToRead" : "5 мин",
  "views" : 606,
  "imgAddress" : "",
  "rubriks" : [ "Управление разработкой*", "Agile*" ],
  "prehedder" : ""
}, {
  "author" : "Documen-Terra",
  "name" : "Правда или вымысел? Разоблачаем мифы о профессии технического писателя",
  "realise" : "Sun Jan 26 14:24:38 MSK 2025",
  "timeToRead" : "10 мин",
  "views" : 369,
  "imgAddress" : "https://habrastorage.org/r/w1560/getpro/habr/upload_files/5d5/953/1c1/5d59531c12530ed79c5256409cac9508.png",
  "rubriks" : [ "Блог компании Документерра", "Карьера в IT-индустрии", "Облачные сервисы*", "Подготовка технической документации*" ],
  "prehedder" : "\"Технический писатель\" — это не просто человек, который документирует то, что уже знают все остальные. Это креативный инженер, к которому идут за пониманием, а не просто за инструкциями. Разберём главные мифы о профессии и покажем, что на самом деле скрывается за этими двумя словами."
}, {
  "author" : "Nina_Feshchenko",
  "name" : "Прогнозирование продаж с использованием библиотеки Prophet, часть 2",
  "realise" : "Sun Jan 26 17:19:38 MSK 2025",
  "timeToRead" : "5 мин",
  "views" : 171,
  "imgAddress" : "https://habrastorage.org/r/w1560/getpro/habr/upload_files/a40/132/ba5/a40132ba565d8a8cfffe6ce3819d614e.png",
  "rubriks" : [ "Блог компании билайн", "Машинное обучение*", "Статистика в IT", "Big Data*" ],
  "prehedder" : "Привет! Продолжаю знакомить вас с библиотекой Prophet в качестве инстурмента прогнозирования продаж. Первая часть тут. Функции для критериев качества в нашей прогнозной модели будут выглядеть следующим образом:"
}, {
  "author" : "parus-lead",
  "name" : "Симулятор брокера Apache Kafka: Kafka Visualization от компании SoftwareMill",
  "realise" : "Sun Jan 26 15:06:13 MSK 2025",
  "timeToRead" : "7 мин",
  "views" : 648,
  "imgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/c01/d2a/fc8/c01d2afc80d6178ad8902cc57c113907.jpg",
  "rubriks" : [ "Apache*" ],
  "prehedder" : "На сегодняшний день потоковая обработка и анализ данных стала неотъемлемой частью многих бизнес-процессов и технологических решений. Для эффективного управления большими объемами данных необходимы инструменты, которые не только обеспечивают надежность передачи сообщений, но и позволяют визуализировать их потоки, обеспечивая прозрачность и удобство мониторинга. В моей предыдущей статье про симулятор одного из самых популярных брокеров сообщений — RabbitMQ (https://habr.com/ru/articles/859982/) много читателей оставляли в личку разные вопросы, но одним из самых популярных и часто задаваемых стал: \"Очень классный и удобный симулятор! А есть ли такой же для Kafka?\" И тут я понял: действительно, несправедливо рассказывать и, так сказать, нести в массы симулятор одного типа брокеров, но совершенно забыть про другой. Ну что ж, Кафка, значит, Кафка! На просторах всемирной паутины, к сожалению, стопроцентного аналога-конструктора, такого как RabbitMQ Simulator, к сожалению, я не нашел. Но мы же знаем, что этой статьи не было бы, если бы я не нашел что-то интересное. И сегодня это будет Kafka Visualization от компании SoftwareMill."
}, {
  "author" : "RomanSeleznev",
  "name" : "Управление вёрсткой в PlantUML",
  "realise" : "Sun Jan 26 16:39:23 MSK 2025",
  "timeToRead" : "14 мин",
  "views" : 463,
  "imgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/e31/4c3/f4c/e314c3f4cdfab82357d67cca79a7630a.jpg",
  "rubriks" : [ "Анализ и проектирование систем*", "UML Design*" ],
  "prehedder" : "Каждый, кто пользовался PlantUML, знает, что этот инструмент хорош тем, что позволяет создавать разнообразные диаграммы без необходимости ручного позиционирования их элементов: написал код — получил рендеринг. Но, как известно, у медали две стороны. В данном случае вторая сторона медали это не всегда понятные правила, которыми руководствуется логика, лежащая в основе движка PlantUML. Как следствие, иногда получаются не самые эстетически привлекательные диаграммы, а поиск ответа на вопрос, как повлиять на автоматическую расстановку элементов, заводит в тупик. Это происходит из-за того, что доступной информации об управлении вёрсткой в PlantUML практически нет. В данной статье я попытаюсь закрыть этот пробел и заодно поделюсь некоторыми полезными приёмами, чтобы снизить порог вхождения в работу с PlantUML."
} ]