[ {
  "Author" : "gonzazoid",
  "Name" : "Ultimatum — еще один форк хромиума, с претензией…",
  "Realise" : "Sat Jan 25 14:04:54 MSK 2025",
  "TimeToRead" : "10 мин",
  "Views" : "36",
  "ImgAddress" : "",
  "Rubriks" : [ "C++*", "JavaScript*", "Open source*", "Браузеры", "Расширения для браузеров" ],
  "Prehedder" : ""
}, {
  "Author" : "myoffice_ru",
  "Name" : "Тривиальное перемещение и рефлексия: реализуем фичу из C++26 в библиотеке",
  "Realise" : "Sat Jan 25 12:41:47 MSK 2025",
  "TimeToRead" : "8 мин",
  "Views" : "360",
  "ImgAddress" : "https://habrastorage.org/getpro/habr/upload_files/97d/e40/35e/97de4035eea962eeb53f1719dc5b97e6.PNG",
  "Rubriks" : [ "Блог компании МойОфис", "C++*", "Программирование*" ],
  "Prehedder" : "В статье разработчик Барри Ревзин* объясняет, как можно определить и проверить свойства типов для обеспечения тривиального перемещения, разбирая нюансы эффективности, удобства и точности реализации. Основная проблема здесь в необходимости учёта всех особенностей типов, включая пользовательские функции, наследование и перегрузку. Это требует как сложных эвристик, так и новых инструментов языка. Под катом вы найдёте решение с аннотациями и механизмами рефлексии для создания гибкой и относительно компактной реализации. Автор показывает потенциал рефлексии в автоматизации задач, которые ранее требовали дополнительных усилий, и демонстрирует возможности для улучшения библиотек и кода на C++. *Обращаем ваше внимание, что позиция автора может не всегда совпадать с мнением МойОфис"
}, {
  "Author" : "Slacky1965",
  "Name" : "Перепрограммируем заводской термостат Zigbee для теплого пола от компании Tuya",
  "Realise" : "Sat Jan 25 11:56:12 MSK 2025",
  "TimeToRead" : "10 мин",
  "Views" : "941",
  "ImgAddress" : "https://habrastorage.org/r/w1560/getpro/habr/upload_files/39f/2e2/240/39f2e22409095ba29acb739c12e21773.png",
  "Rubriks" : [ "C*", "Беспроводные технологии*", "Программирование микроконтроллеров*", "Разработка для интернета вещей*", "Умный дом" ],
  "Prehedder" : "Автор не несет ответственности, если данная статья сделает из вашего умного термостата полоумный. Для пользователей умных домов, которые строят свои системы на протоколе Zigbee, название Tuya знакомо, как никогда. Причем в последнее время название Tuya не всегда ассоциируют именно с компанией Tuya. Очень много китайских компаний выпускают свои изделия, в сердце которых лежит платформа Tuya. Вот весь этот \"зоопарк\" и принято называть Tuya."
}, {
  "Author" : "JBFW",
  "Name" : "Улучшаем систему видеонаблюдения, ч.2",
  "Realise" : "Sat Jan 25 11:37:06 MSK 2025",
  "TimeToRead" : "4 мин",
  "Views" : "375",
  "ImgAddress" : "",
  "Rubriks" : [ "Умный дом" ],
  "Prehedder" : ""
}, {
  "Author" : "videoelektronic",
  "Name" : "Длины волн и энергии линий характеристического излучения (по элементам от Лития до Иттрия )",
  "Realise" : "Sat Jan 25 11:34:37 MSK 2025",
  "TimeToRead" : "2 мин",
  "Views" : "268",
  "ImgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/48e/b12/a6d/48eb12a6df926e74c92ade5966ab496b.jpg",
  "Rubriks" : [ "Научно-популярное" ],
  "Prehedder" : "Когда-то из ру-нета был доступ к вражескому сайту, где была выложена глава «Энциклопедии химика-технолога», посвящённая характеристическому рентгеновскому излучению. В этой энциклопедии я нашёл наиболее полную таблицу с информацией по длинам волн и энергиям рентгеновских фотонов излучения разных химических веществ. Потом доступ к этому сайту пропал, но я, в своё время, успел распечатать эту табличку на бумажный носитель. Теперь я решил заняться работой по выкладыванию данной информации в Сеть. Надеюсь, она будет полезна многим, кто интересуется темой рентгена. Для тех, кто совсем не в теме, поясню, что рентгеновское излучение бывает нескольких видов (по способу его генерации) - тормозное (за счёт резкого торможения электронов в аноде рентгеновской трубки), синхротронное (за счёт поворота потока электронов в магнитной системе синхротрона), характеристическое (за счёт излучения вещества под потоком электронов или фотонов в результате переходов электронов атомов из вышележащих уровней на вакантное место выбитых электронов). Отдельно можно ещё сказать, что гамма-излучение (т.е. электромагнитное излучение в результате ядерных реакций деления) тоже может лежать в рентгеновском спектре, а так же тепловое излучение может простираться в рентгеновский диапазон длин волн. Характеристическое излучение излучается рентгеновской трубкой в том случае, если энергии первичных (т.е. излучённых катодом и ускоренных электрическим полем электронов) достаточно для выбивания собственных электронов атомов мишени. Обычно можно считать, что пики характеристического излучения возникают в рентгеновской трубке тогда, когда энергия, переданная первичным электронам электрическим полем между её катодом и анодом (напряжение катод-анод) становится больше уровня характеристической энергии того или иного пика излучения."
}, {
  "Author" : "BOTCODERS",
  "Name" : "Получение информации о системе с помощью Python",
  "Realise" : "Sat Jan 25 11:20:01 MSK 2025",
  "TimeToRead" : "5 мин",
  "Views" : "584",
  "ImgAddress" : "",
  "Rubriks" : [ "Системное администрирование*", "Python*" ],
  "Prehedder" : ""
}, {
  "Author" : "RoboForm",
  "Name" : "Мобильная разработка за неделю #567 (2 — 8 декабря)",
  "Realise" : "Sat Jan 25 11:07:02 MSK 2025",
  "TimeToRead" : "4 мин",
  "Views" : "192",
  "ImgAddress" : "",
  "Rubriks" : [ "Монетизация мобильных приложений*", "Разработка под Android*", "Разработка под iOS*" ],
  "Prehedder" : ""
}, {
  "Author" : "tmplts",
  "Name" : "Управление проектами: дайджест публикаций #22",
  "Realise" : "Sat Jan 25 10:48:45 MSK 2025",
  "TimeToRead" : "8 мин",
  "Views" : "203",
  "ImgAddress" : "https://habrastorage.org/r/w1560/getpro/habr/upload_files/470/d45/f5c/470d45f5cb848c595b44dea2d8ac07d0.png",
  "Rubriks" : [ "Управление проектами*" ],
  "Prehedder" : "USM, НеЖелательные Явления, ненужная документация, допущения и ограничения, тупиковый путь в тимлиды, красные флаги при трудоустройстве и всё интересное, что писали на этой неделе про управление проектами. Мы прочитали все публикации и выбрали для вас самые крутые и полезные. Читайте, сохраняйте и применяйте!"
}, {
  "Author" : "Adm1ngmz",
  "Name" : "Анализ аккаунтов Telegram",
  "Realise" : "Sat Jan 25 10:45:34 MSK 2025",
  "TimeToRead" : "4 мин",
  "Views" : "538",
  "ImgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/e14/5fe/7c3/e145fe7c3d99ce9767510bc496b04df4.jpg",
  "Rubriks" : [ "Информационная безопасность*", "Геоинформационные сервисы*" ],
  "Prehedder" : "Приветствуем снова дорогих читателей! Продолжаем цикл статей \"ШХ\" и сегодня нашим блюдом будет Telegram. В ранних статьях мы рассмотрели способы аккаунтов целевого пользователя по его никнейму, после чего проводили разведку его аккаунта в социальной сети Вконтакте. На данном этапе мы ставим для себя важным узнать номер телефона пользователя, т.к. от номера уже можно будет неплохо отталкиваться в разведке и номер телефона может поведать о ещё подробней о своём владельце. В прошлой статье мы пытались выяснить номер при помощи страницы Вконтакте, а в этой как уже догадались по названию, мы будем пытаться выяснить как можно больше информации об аккаунте Telegram. Данный материал отредактирован и опубликован повторно, в связи в блокировкой прошлого материала РКН на территории РФ. Дисклеймер: Все данные предоставленные в этой статье взяты из открытых источников. Не призывают к действию и размещены только лишь для ознакомления и изучения механизмов используемых технологий."
}, {
  "Author" : "fcrng",
  "Name" : "Вопросы к UI. Вступление",
  "Realise" : "Sat Jan 25 10:14:43 MSK 2025",
  "TimeToRead" : "9 мин",
  "Views" : "496",
  "ImgAddress" : "https://habrastorage.org/r/w1560/getpro/habr/upload_files/5ce/2e1/145/5ce2e1145020083d68cbe2060ba12a7b.png",
  "Rubriks" : [ "Интерфейсы*", "Веб-разработка*", "JavaScript*" ],
  "Prehedder" : "Не знаю как до вас донести это, и насколько осторожно следует подбирать слова. Мне больно от того, как сейчас происходит создание пользовательских интерфейсов, а существующие подходы кажутся каким‑то недоразумением. И поймите, речь обо всех платформах — веб, мобилки, десктоп. Будучи разработчиком, и исследуя «новые» способы реализации UI, сквозь годы опыта смотришь на все это дело с тяжелым вздохом, мотаешь головой из стороны в сторону, и все что хочется — захлопнуть крышку ноутбука и заняться чем‑то другим. А сталкиваясь с этим изо дня в день на работе — не знаю, как мы не кричим от этого, правда не знаю. И нет, не стану говорить о том, что текущие инструменты не работают, это неправда. Приложив достаточное количество усилий, и да, возможно, несколько раз ударив себя же по лицу, вы с их помощью выполните все или почти все возложенные на вас задачи. Вопрос лишь в том — какой ценой."
}, {
  "Author" : "Seleditor",
  "Name" : "Мини-ПК декабря 2024: лучшие новинки месяца. Что предлагают производители?",
  "Realise" : "Sat Jan 25 10:09:11 MSK 2025",
  "TimeToRead" : "4 мин",
  "Views" : "2.4K",
  "ImgAddress" : "",
  "Rubriks" : [ "Блог компании Selectel", "Гаджеты", "Компьютерное железо" ],
  "Prehedder" : ""
}, {
  "Author" : "ramayasket",
  "Name" : "Математические бланки // Часть 3: математическая реальность",
  "Realise" : "Sat Jan 25 09:41:02 MSK 2025",
  "TimeToRead" : "15 мин",
  "Views" : "495",
  "ImgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/466/173/8eb/4661738ebbb886823abf3a78e281beca.jpg",
  "Rubriks" : [ "Программирование*", "Математика*", "Искусственный интеллект" ],
  "Prehedder" : "В первой части этой серии мы описали проблему математических бланков, и перспективные результаты её решения. Вторая часть показала, что эта проблема упирается в вопрос экземпляров. Он, в свою очередь, может быть решён в рамках модели идеального мира, который должен обладать памятью. Чтобы подступиться к теме памяти идеального мира, нам нужно с максимальной подробностью разобраться, что такое вообще память, какая она бывает, какие функции выполняет, какими характеристиками обладает, привести подтверждающие примеры. Исследование низшей математики - это 90% ожидания, 9% отчаяния, и только 1% озарения. Здесь, опустив 99%, можно сразу узнать результат. И в результате, памятью окажется то, что гораздо старше и математики, и самой человеческой истории. И оно всё это время перед глазами. Вот уж точно, хочешь спрятать, прячь на самом виду. Хотите узнать, что это? Не переключайтесь."
}, {
  "Author" : "Deevilleto",
  "Name" : "Умная система обучения для детей до 3 лет. Animal Island Aila",
  "Realise" : "Sat Jan 25 09:37:00 MSK 2025",
  "TimeToRead" : "5 мин",
  "Views" : "123",
  "ImgAddress" : "https://habrastorage.org/r/w1560/getpro/habr/upload_files/6e2/50f/da9/6e250fda9ead8f74430e97e0a54a6dec.png",
  "Rubriks" : [ "Разработка мобильных приложений*", "Разработка под Android*", "Разработка под iOS*", "Облачные сервисы*" ],
  "Prehedder" : "В современном мире технологии играют всё более важную роль в обучении и развитии детей. Проект \"Animal Island Aila\" — это инновационная умная система, созданная специально для малышей от 12 до 36 месяцев. Она помогает детям познакомиться с основами английского языка (цвета, формы, буквы), расширяет словарный запас и делает процесс обучения увлекательным. В 2019 году я имел возможность участвовать в разработке этой системы. Моя задача заключалась в создании как серверной, так и клиентской части проекта. Суть проекта Проект \"Animal Island Aila\" реализован на основе клиент-серверной архитектуры и включает два отдельных приложения: одно для детей, а другое для родителей. В качестве сервера используется облачная платформа Amazon Web Services. Приложение для детей, разработанное на Kotlin, работает на специальном Android-планшете Aila Sit & Play™. Оно демонстрирует различные обучающие видео, рассказы и колыбельные для детей. Приложение для родителей, разработанное на Flutter и Dart, доступно для платформ Android и iOS. Оно позволяет родителям управлять детским устройством и наблюдать за детьми в реальном времени. Архитектура серверной части Серверная часть проекта реализована с использованием AWS Serverless, набора облачных услуг от Amazon, позволяющих разработчикам создавать и управлять приложениями без необходимости обслуживания физических серверов. Основные преимущества этой технологии включают автоматическое масштабирование, оплату только за фактическое использование ресурсов и упрощенное развертывание приложений."
}, {
  "Author" : "andreybrylb",
  "Name" : "Сквозь губку Менгера. Как старшеклассники решают вековые задачи фрактальной топологии",
  "Realise" : "Sat Jan 25 09:34:52 MSK 2025",
  "TimeToRead" : "7 мин",
  "Views" : "587",
  "ImgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/c20/c4a/39d/c20c4a39d01779f10e8612c53830d414.jpg",
  "Rubriks" : [ "Математика*", "Научно-популярное" ],
  "Prehedder" : "Осенью 2021 года Малорс Эспиноза решил создать особенную математическую задачу. Она должна была быть достаточно сложной, чтобы стимулировать размышления и вызывать интерес к её решению, но при этом оставаться доступной для старшеклассников. Малорс, будучи аспирантом по математике в Университете Торонто, столкнулся с этим дополнительным вызовом. В течение нескольких лет он организовывал летние семинары для местных школьников, знакомя их с основами математических исследований и обучая писать доказательства. Некоторые ученики проявляли интерес к более глубокому пониманию математики — к задачам, где нет очевидного ответа. Им требовался правильный вопрос, чтобы направить их интерес. Такой вопрос Малорс нашёл, изучая учебник по теории хаоса. Там он наткнулся на знакомый объект — фрактал под названием «губка Менгера». Этот самоподобный объект строится по простому, но изящному принципу: сначала куб делится на части, подобные кубику Рубика. Затем удаляется центральный куб и центральные части каждой из шести граней. Этот процесс повторяется для оставшихся кубов снова и снова. С каждой итерацией структура становится всё более пористой, что и делает её похожей на губку."
}, {
  "Author" : "Keep_lookout",
  "Name" : "Как развлечься с моделями, если хочется чего-то необычного",
  "Realise" : "Sat Jan 25 09:21:55 MSK 2025",
  "TimeToRead" : "14 мин",
  "Views" : "447",
  "ImgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/a03/d98/706/a03d9870658bed3187786724f81d3750.jpg",
  "Rubriks" : [ "Машинное обучение*", "Искусственный интеллект", "Программирование*" ],
  "Prehedder" : "Написать эту статью меня побудило серьезное научное исследование, которое обосновало прекрасный и оригинальный метод Chain of Code (CoC) улучшения рассуждений моделей и точности их ответов. Суть метода заключается в том, чтобы заставить модель написать подходящий программный код, соответствующий поставленной в промпте задаче, интерпретировать его выполнение и на основе полученного результата сформировать более логичный, точный и достоверный ответ. Метод особенно хорошо работает в логических и математических задачах и я считаю, что он заслуживает пристального внимания программистов, как оригинальный и эффективный подход к решению различных хорошо структурированных задач. Я решил продемонстрировать его работу, но так, чтобы было интересно и не скучно. Поэтому предлагаю развлечься с моделями, а поскольку для нашей цели одной будет маловато, то давайте сразу с тремя."
}, {
  "Author" : "Bright_Translate",
  "Name" : "Элегантная математика фильтров Блума",
  "Realise" : "Sat Jan 25 09:13:00 MSK 2025",
  "TimeToRead" : "7 мин",
  "Views" : "750",
  "ImgAddress" : "",
  "Rubriks" : [ "Блог компании RUVDS.com", "Big Data*", "Алгоритмы*", "Математика*" ],
  "Prehedder" : ""
}, {
  "Author" : "shevchenko_a_d",
  "Name" : "Медианы чисел",
  "Realise" : "Sat Jan 25 08:42:19 MSK 2025",
  "TimeToRead" : "3 мин",
  "Views" : "431",
  "ImgAddress" : "",
  "Rubriks" : [ "C++*", "Алгоритмы*" ],
  "Prehedder" : ""
}, {
  "Author" : "integralik",
  "Name" : "Базовое программирование, или Почему джуны не могут пройти к нам собеседование",
  "Realise" : "Sat Jan 25 08:24:45 MSK 2025",
  "TimeToRead" : "8 мин",
  "Views" : "4.4K",
  "ImgAddress" : "",
  "Rubriks" : [ "JavaScript*", "PHP*", "Карьера в IT-индустрии" ],
  "Prehedder" : ""
}, {
  "Author" : "igor_zvyagin",
  "Name" : "Как вырваться из матрицы? Мнение программиста",
  "Realise" : "Sat Jan 25 08:09:03 MSK 2025",
  "TimeToRead" : "8 мин",
  "Views" : "807",
  "ImgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/2c7/d26/f3c/2c7d26f3cbe1a276324df9a1edaec2fc.jpeg",
  "Rubriks" : [ "Чулан" ],
  "Prehedder" : "Некоторое время назад возмутил Хабр статьей про то, что убежден - мы находимся в симуляции. Было много как позитивных, так и негативных отзывов. Статью даже пытались заблокировать, (возможно, из-за вмешательства «администраторов Матрицы»), вторую часть, так и не пропустили. Было много вопросов, в чем смысл симуляции, если она действительно существует. Другими словами, в чем смысл жизни? Позволю себе посветить в определенную сторону, на то, что уже на виду, на то, что уже происходит. Как мне кажется, мы с вами на пороге создания собственной симуляции. Может не с технической точки зрения, но запрос на создание симуляции уже витает в воздухе."
}, {
  "Author" : "OldfagGamer",
  "Name" : "Ностальгические игры: Far Cry",
  "Realise" : "Sat Jan 25 07:05:29 MSK 2025",
  "TimeToRead" : "14 мин",
  "Views" : "1.9K",
  "ImgAddress" : "",
  "Rubriks" : [ "Блог компании Timeweb Cloud", "Игры и игровые консоли", "Разработка игр*", "Читальный зал" ],
  "Prehedder" : ""
}, {
  "Author" : "gonzazoid",
  "Name" : "Ultimatum — еще один форк хромиума, с претензией…",
  "Realise" : "Sat Jan 25 14:04:54 MSK 2025",
  "TimeToRead" : "10 мин",
  "Views" : "36",
  "ImgAddress" : "",
  "Rubriks" : [ "C++*", "JavaScript*", "Open source*", "Браузеры", "Расширения для браузеров" ],
  "Prehedder" : ""
}, {
  "Author" : "myoffice_ru",
  "Name" : "Тривиальное перемещение и рефлексия: реализуем фичу из C++26 в библиотеке",
  "Realise" : "Sat Jan 25 12:41:47 MSK 2025",
  "TimeToRead" : "8 мин",
  "Views" : "360",
  "ImgAddress" : "https://habrastorage.org/getpro/habr/upload_files/97d/e40/35e/97de4035eea962eeb53f1719dc5b97e6.PNG",
  "Rubriks" : [ "Блог компании МойОфис", "C++*", "Программирование*" ],
  "Prehedder" : "В статье разработчик Барри Ревзин* объясняет, как можно определить и проверить свойства типов для обеспечения тривиального перемещения, разбирая нюансы эффективности, удобства и точности реализации. Основная проблема здесь в необходимости учёта всех особенностей типов, включая пользовательские функции, наследование и перегрузку. Это требует как сложных эвристик, так и новых инструментов языка. Под катом вы найдёте решение с аннотациями и механизмами рефлексии для создания гибкой и относительно компактной реализации. Автор показывает потенциал рефлексии в автоматизации задач, которые ранее требовали дополнительных усилий, и демонстрирует возможности для улучшения библиотек и кода на C++. *Обращаем ваше внимание, что позиция автора может не всегда совпадать с мнением МойОфис"
}, {
  "Author" : "Slacky1965",
  "Name" : "Перепрограммируем заводской термостат Zigbee для теплого пола от компании Tuya",
  "Realise" : "Sat Jan 25 11:56:12 MSK 2025",
  "TimeToRead" : "10 мин",
  "Views" : "941",
  "ImgAddress" : "https://habrastorage.org/r/w1560/getpro/habr/upload_files/39f/2e2/240/39f2e22409095ba29acb739c12e21773.png",
  "Rubriks" : [ "C*", "Беспроводные технологии*", "Программирование микроконтроллеров*", "Разработка для интернета вещей*", "Умный дом" ],
  "Prehedder" : "Автор не несет ответственности, если данная статья сделает из вашего умного термостата полоумный. Для пользователей умных домов, которые строят свои системы на протоколе Zigbee, название Tuya знакомо, как никогда. Причем в последнее время название Tuya не всегда ассоциируют именно с компанией Tuya. Очень много китайских компаний выпускают свои изделия, в сердце которых лежит платформа Tuya. Вот весь этот \"зоопарк\" и принято называть Tuya."
}, {
  "Author" : "JBFW",
  "Name" : "Улучшаем систему видеонаблюдения, ч.2",
  "Realise" : "Sat Jan 25 11:37:06 MSK 2025",
  "TimeToRead" : "4 мин",
  "Views" : "375",
  "ImgAddress" : "",
  "Rubriks" : [ "Умный дом" ],
  "Prehedder" : ""
}, {
  "Author" : "videoelektronic",
  "Name" : "Длины волн и энергии линий характеристического излучения (по элементам от Лития до Иттрия )",
  "Realise" : "Sat Jan 25 11:34:37 MSK 2025",
  "TimeToRead" : "2 мин",
  "Views" : "268",
  "ImgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/48e/b12/a6d/48eb12a6df926e74c92ade5966ab496b.jpg",
  "Rubriks" : [ "Научно-популярное" ],
  "Prehedder" : "Когда-то из ру-нета был доступ к вражескому сайту, где была выложена глава «Энциклопедии химика-технолога», посвящённая характеристическому рентгеновскому излучению. В этой энциклопедии я нашёл наиболее полную таблицу с информацией по длинам волн и энергиям рентгеновских фотонов излучения разных химических веществ. Потом доступ к этому сайту пропал, но я, в своё время, успел распечатать эту табличку на бумажный носитель. Теперь я решил заняться работой по выкладыванию данной информации в Сеть. Надеюсь, она будет полезна многим, кто интересуется темой рентгена. Для тех, кто совсем не в теме, поясню, что рентгеновское излучение бывает нескольких видов (по способу его генерации) - тормозное (за счёт резкого торможения электронов в аноде рентгеновской трубки), синхротронное (за счёт поворота потока электронов в магнитной системе синхротрона), характеристическое (за счёт излучения вещества под потоком электронов или фотонов в результате переходов электронов атомов из вышележащих уровней на вакантное место выбитых электронов). Отдельно можно ещё сказать, что гамма-излучение (т.е. электромагнитное излучение в результате ядерных реакций деления) тоже может лежать в рентгеновском спектре, а так же тепловое излучение может простираться в рентгеновский диапазон длин волн. Характеристическое излучение излучается рентгеновской трубкой в том случае, если энергии первичных (т.е. излучённых катодом и ускоренных электрическим полем электронов) достаточно для выбивания собственных электронов атомов мишени. Обычно можно считать, что пики характеристического излучения возникают в рентгеновской трубке тогда, когда энергия, переданная первичным электронам электрическим полем между её катодом и анодом (напряжение катод-анод) становится больше уровня характеристической энергии того или иного пика излучения."
}, {
  "Author" : "BOTCODERS",
  "Name" : "Получение информации о системе с помощью Python",
  "Realise" : "Sat Jan 25 11:20:01 MSK 2025",
  "TimeToRead" : "5 мин",
  "Views" : "584",
  "ImgAddress" : "",
  "Rubriks" : [ "Системное администрирование*", "Python*" ],
  "Prehedder" : ""
}, {
  "Author" : "RoboForm",
  "Name" : "Мобильная разработка за неделю #567 (2 — 8 декабря)",
  "Realise" : "Sat Jan 25 11:07:02 MSK 2025",
  "TimeToRead" : "4 мин",
  "Views" : "192",
  "ImgAddress" : "",
  "Rubriks" : [ "Монетизация мобильных приложений*", "Разработка под Android*", "Разработка под iOS*" ],
  "Prehedder" : ""
}, {
  "Author" : "tmplts",
  "Name" : "Управление проектами: дайджест публикаций #22",
  "Realise" : "Sat Jan 25 10:48:45 MSK 2025",
  "TimeToRead" : "8 мин",
  "Views" : "203",
  "ImgAddress" : "https://habrastorage.org/r/w1560/getpro/habr/upload_files/470/d45/f5c/470d45f5cb848c595b44dea2d8ac07d0.png",
  "Rubriks" : [ "Управление проектами*" ],
  "Prehedder" : "USM, НеЖелательные Явления, ненужная документация, допущения и ограничения, тупиковый путь в тимлиды, красные флаги при трудоустройстве и всё интересное, что писали на этой неделе про управление проектами. Мы прочитали все публикации и выбрали для вас самые крутые и полезные. Читайте, сохраняйте и применяйте!"
}, {
  "Author" : "Adm1ngmz",
  "Name" : "Анализ аккаунтов Telegram",
  "Realise" : "Sat Jan 25 10:45:34 MSK 2025",
  "TimeToRead" : "4 мин",
  "Views" : "538",
  "ImgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/e14/5fe/7c3/e145fe7c3d99ce9767510bc496b04df4.jpg",
  "Rubriks" : [ "Информационная безопасность*", "Геоинформационные сервисы*" ],
  "Prehedder" : "Приветствуем снова дорогих читателей! Продолжаем цикл статей \"ШХ\" и сегодня нашим блюдом будет Telegram. В ранних статьях мы рассмотрели способы аккаунтов целевого пользователя по его никнейму, после чего проводили разведку его аккаунта в социальной сети Вконтакте. На данном этапе мы ставим для себя важным узнать номер телефона пользователя, т.к. от номера уже можно будет неплохо отталкиваться в разведке и номер телефона может поведать о ещё подробней о своём владельце. В прошлой статье мы пытались выяснить номер при помощи страницы Вконтакте, а в этой как уже догадались по названию, мы будем пытаться выяснить как можно больше информации об аккаунте Telegram. Данный материал отредактирован и опубликован повторно, в связи в блокировкой прошлого материала РКН на территории РФ. Дисклеймер: Все данные предоставленные в этой статье взяты из открытых источников. Не призывают к действию и размещены только лишь для ознакомления и изучения механизмов используемых технологий."
}, {
  "Author" : "fcrng",
  "Name" : "Вопросы к UI. Вступление",
  "Realise" : "Sat Jan 25 10:14:43 MSK 2025",
  "TimeToRead" : "9 мин",
  "Views" : "496",
  "ImgAddress" : "https://habrastorage.org/r/w1560/getpro/habr/upload_files/5ce/2e1/145/5ce2e1145020083d68cbe2060ba12a7b.png",
  "Rubriks" : [ "Интерфейсы*", "Веб-разработка*", "JavaScript*" ],
  "Prehedder" : "Не знаю как до вас донести это, и насколько осторожно следует подбирать слова. Мне больно от того, как сейчас происходит создание пользовательских интерфейсов, а существующие подходы кажутся каким‑то недоразумением. И поймите, речь обо всех платформах — веб, мобилки, десктоп. Будучи разработчиком, и исследуя «новые» способы реализации UI, сквозь годы опыта смотришь на все это дело с тяжелым вздохом, мотаешь головой из стороны в сторону, и все что хочется — захлопнуть крышку ноутбука и заняться чем‑то другим. А сталкиваясь с этим изо дня в день на работе — не знаю, как мы не кричим от этого, правда не знаю. И нет, не стану говорить о том, что текущие инструменты не работают, это неправда. Приложив достаточное количество усилий, и да, возможно, несколько раз ударив себя же по лицу, вы с их помощью выполните все или почти все возложенные на вас задачи. Вопрос лишь в том — какой ценой."
}, {
  "Author" : "Seleditor",
  "Name" : "Мини-ПК декабря 2024: лучшие новинки месяца. Что предлагают производители?",
  "Realise" : "Sat Jan 25 10:09:11 MSK 2025",
  "TimeToRead" : "4 мин",
  "Views" : "2.4K",
  "ImgAddress" : "",
  "Rubriks" : [ "Блог компании Selectel", "Гаджеты", "Компьютерное железо" ],
  "Prehedder" : ""
}, {
  "Author" : "ramayasket",
  "Name" : "Математические бланки // Часть 3: математическая реальность",
  "Realise" : "Sat Jan 25 09:41:02 MSK 2025",
  "TimeToRead" : "15 мин",
  "Views" : "495",
  "ImgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/466/173/8eb/4661738ebbb886823abf3a78e281beca.jpg",
  "Rubriks" : [ "Программирование*", "Математика*", "Искусственный интеллект" ],
  "Prehedder" : "В первой части этой серии мы описали проблему математических бланков, и перспективные результаты её решения. Вторая часть показала, что эта проблема упирается в вопрос экземпляров. Он, в свою очередь, может быть решён в рамках модели идеального мира, который должен обладать памятью. Чтобы подступиться к теме памяти идеального мира, нам нужно с максимальной подробностью разобраться, что такое вообще память, какая она бывает, какие функции выполняет, какими характеристиками обладает, привести подтверждающие примеры. Исследование низшей математики - это 90% ожидания, 9% отчаяния, и только 1% озарения. Здесь, опустив 99%, можно сразу узнать результат. И в результате, памятью окажется то, что гораздо старше и математики, и самой человеческой истории. И оно всё это время перед глазами. Вот уж точно, хочешь спрятать, прячь на самом виду. Хотите узнать, что это? Не переключайтесь."
}, {
  "Author" : "Deevilleto",
  "Name" : "Умная система обучения для детей до 3 лет. Animal Island Aila",
  "Realise" : "Sat Jan 25 09:37:00 MSK 2025",
  "TimeToRead" : "5 мин",
  "Views" : "123",
  "ImgAddress" : "https://habrastorage.org/r/w1560/getpro/habr/upload_files/6e2/50f/da9/6e250fda9ead8f74430e97e0a54a6dec.png",
  "Rubriks" : [ "Разработка мобильных приложений*", "Разработка под Android*", "Разработка под iOS*", "Облачные сервисы*" ],
  "Prehedder" : "В современном мире технологии играют всё более важную роль в обучении и развитии детей. Проект \"Animal Island Aila\" — это инновационная умная система, созданная специально для малышей от 12 до 36 месяцев. Она помогает детям познакомиться с основами английского языка (цвета, формы, буквы), расширяет словарный запас и делает процесс обучения увлекательным. В 2019 году я имел возможность участвовать в разработке этой системы. Моя задача заключалась в создании как серверной, так и клиентской части проекта. Суть проекта Проект \"Animal Island Aila\" реализован на основе клиент-серверной архитектуры и включает два отдельных приложения: одно для детей, а другое для родителей. В качестве сервера используется облачная платформа Amazon Web Services. Приложение для детей, разработанное на Kotlin, работает на специальном Android-планшете Aila Sit & Play™. Оно демонстрирует различные обучающие видео, рассказы и колыбельные для детей. Приложение для родителей, разработанное на Flutter и Dart, доступно для платформ Android и iOS. Оно позволяет родителям управлять детским устройством и наблюдать за детьми в реальном времени. Архитектура серверной части Серверная часть проекта реализована с использованием AWS Serverless, набора облачных услуг от Amazon, позволяющих разработчикам создавать и управлять приложениями без необходимости обслуживания физических серверов. Основные преимущества этой технологии включают автоматическое масштабирование, оплату только за фактическое использование ресурсов и упрощенное развертывание приложений."
}, {
  "Author" : "andreybrylb",
  "Name" : "Сквозь губку Менгера. Как старшеклассники решают вековые задачи фрактальной топологии",
  "Realise" : "Sat Jan 25 09:34:52 MSK 2025",
  "TimeToRead" : "7 мин",
  "Views" : "587",
  "ImgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/c20/c4a/39d/c20c4a39d01779f10e8612c53830d414.jpg",
  "Rubriks" : [ "Математика*", "Научно-популярное" ],
  "Prehedder" : "Осенью 2021 года Малорс Эспиноза решил создать особенную математическую задачу. Она должна была быть достаточно сложной, чтобы стимулировать размышления и вызывать интерес к её решению, но при этом оставаться доступной для старшеклассников. Малорс, будучи аспирантом по математике в Университете Торонто, столкнулся с этим дополнительным вызовом. В течение нескольких лет он организовывал летние семинары для местных школьников, знакомя их с основами математических исследований и обучая писать доказательства. Некоторые ученики проявляли интерес к более глубокому пониманию математики — к задачам, где нет очевидного ответа. Им требовался правильный вопрос, чтобы направить их интерес. Такой вопрос Малорс нашёл, изучая учебник по теории хаоса. Там он наткнулся на знакомый объект — фрактал под названием «губка Менгера». Этот самоподобный объект строится по простому, но изящному принципу: сначала куб делится на части, подобные кубику Рубика. Затем удаляется центральный куб и центральные части каждой из шести граней. Этот процесс повторяется для оставшихся кубов снова и снова. С каждой итерацией структура становится всё более пористой, что и делает её похожей на губку."
}, {
  "Author" : "Keep_lookout",
  "Name" : "Как развлечься с моделями, если хочется чего-то необычного",
  "Realise" : "Sat Jan 25 09:21:55 MSK 2025",
  "TimeToRead" : "14 мин",
  "Views" : "447",
  "ImgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/a03/d98/706/a03d9870658bed3187786724f81d3750.jpg",
  "Rubriks" : [ "Машинное обучение*", "Искусственный интеллект", "Программирование*" ],
  "Prehedder" : "Написать эту статью меня побудило серьезное научное исследование, которое обосновало прекрасный и оригинальный метод Chain of Code (CoC) улучшения рассуждений моделей и точности их ответов. Суть метода заключается в том, чтобы заставить модель написать подходящий программный код, соответствующий поставленной в промпте задаче, интерпретировать его выполнение и на основе полученного результата сформировать более логичный, точный и достоверный ответ. Метод особенно хорошо работает в логических и математических задачах и я считаю, что он заслуживает пристального внимания программистов, как оригинальный и эффективный подход к решению различных хорошо структурированных задач. Я решил продемонстрировать его работу, но так, чтобы было интересно и не скучно. Поэтому предлагаю развлечься с моделями, а поскольку для нашей цели одной будет маловато, то давайте сразу с тремя."
}, {
  "Author" : "Bright_Translate",
  "Name" : "Элегантная математика фильтров Блума",
  "Realise" : "Sat Jan 25 09:13:00 MSK 2025",
  "TimeToRead" : "7 мин",
  "Views" : "750",
  "ImgAddress" : "",
  "Rubriks" : [ "Блог компании RUVDS.com", "Big Data*", "Алгоритмы*", "Математика*" ],
  "Prehedder" : ""
}, {
  "Author" : "shevchenko_a_d",
  "Name" : "Медианы чисел",
  "Realise" : "Sat Jan 25 08:42:19 MSK 2025",
  "TimeToRead" : "3 мин",
  "Views" : "431",
  "ImgAddress" : "",
  "Rubriks" : [ "C++*", "Алгоритмы*" ],
  "Prehedder" : ""
}, {
  "Author" : "integralik",
  "Name" : "Базовое программирование, или Почему джуны не могут пройти к нам собеседование",
  "Realise" : "Sat Jan 25 08:24:45 MSK 2025",
  "TimeToRead" : "8 мин",
  "Views" : "4.4K",
  "ImgAddress" : "",
  "Rubriks" : [ "JavaScript*", "PHP*", "Карьера в IT-индустрии" ],
  "Prehedder" : ""
}, {
  "Author" : "igor_zvyagin",
  "Name" : "Как вырваться из матрицы? Мнение программиста",
  "Realise" : "Sat Jan 25 08:09:03 MSK 2025",
  "TimeToRead" : "8 мин",
  "Views" : "807",
  "ImgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/2c7/d26/f3c/2c7d26f3cbe1a276324df9a1edaec2fc.jpeg",
  "Rubriks" : [ "Чулан" ],
  "Prehedder" : "Некоторое время назад возмутил Хабр статьей про то, что убежден - мы находимся в симуляции. Было много как позитивных, так и негативных отзывов. Статью даже пытались заблокировать, (возможно, из-за вмешательства «администраторов Матрицы»), вторую часть, так и не пропустили. Было много вопросов, в чем смысл симуляции, если она действительно существует. Другими словами, в чем смысл жизни? Позволю себе посветить в определенную сторону, на то, что уже на виду, на то, что уже происходит. Как мне кажется, мы с вами на пороге создания собственной симуляции. Может не с технической точки зрения, но запрос на создание симуляции уже витает в воздухе."
}, {
  "Author" : "OldfagGamer",
  "Name" : "Ностальгические игры: Far Cry",
  "Realise" : "Sat Jan 25 07:05:29 MSK 2025",
  "TimeToRead" : "14 мин",
  "Views" : "1.9K",
  "ImgAddress" : "",
  "Rubriks" : [ "Блог компании Timeweb Cloud", "Игры и игровые консоли", "Разработка игр*", "Читальный зал" ],
  "Prehedder" : ""
}, {
  "Author" : "gonzazoid",
  "Name" : "Ultimatum — еще один форк хромиума, с претензией…",
  "Realise" : "Sat Jan 25 14:04:54 MSK 2025",
  "TimeToRead" : "10 мин",
  "Views" : "36",
  "ImgAddress" : "",
  "Rubriks" : [ "C++*", "JavaScript*", "Open source*", "Браузеры", "Расширения для браузеров" ],
  "Prehedder" : ""
}, {
  "Author" : "myoffice_ru",
  "Name" : "Тривиальное перемещение и рефлексия: реализуем фичу из C++26 в библиотеке",
  "Realise" : "Sat Jan 25 12:41:47 MSK 2025",
  "TimeToRead" : "8 мин",
  "Views" : "360",
  "ImgAddress" : "https://habrastorage.org/getpro/habr/upload_files/97d/e40/35e/97de4035eea962eeb53f1719dc5b97e6.PNG",
  "Rubriks" : [ "Блог компании МойОфис", "C++*", "Программирование*" ],
  "Prehedder" : "В статье разработчик Барри Ревзин* объясняет, как можно определить и проверить свойства типов для обеспечения тривиального перемещения, разбирая нюансы эффективности, удобства и точности реализации. Основная проблема здесь в необходимости учёта всех особенностей типов, включая пользовательские функции, наследование и перегрузку. Это требует как сложных эвристик, так и новых инструментов языка. Под катом вы найдёте решение с аннотациями и механизмами рефлексии для создания гибкой и относительно компактной реализации. Автор показывает потенциал рефлексии в автоматизации задач, которые ранее требовали дополнительных усилий, и демонстрирует возможности для улучшения библиотек и кода на C++. *Обращаем ваше внимание, что позиция автора может не всегда совпадать с мнением МойОфис"
}, {
  "Author" : "Slacky1965",
  "Name" : "Перепрограммируем заводской термостат Zigbee для теплого пола от компании Tuya",
  "Realise" : "Sat Jan 25 11:56:12 MSK 2025",
  "TimeToRead" : "10 мин",
  "Views" : "941",
  "ImgAddress" : "https://habrastorage.org/r/w1560/getpro/habr/upload_files/39f/2e2/240/39f2e22409095ba29acb739c12e21773.png",
  "Rubriks" : [ "C*", "Беспроводные технологии*", "Программирование микроконтроллеров*", "Разработка для интернета вещей*", "Умный дом" ],
  "Prehedder" : "Автор не несет ответственности, если данная статья сделает из вашего умного термостата полоумный. Для пользователей умных домов, которые строят свои системы на протоколе Zigbee, название Tuya знакомо, как никогда. Причем в последнее время название Tuya не всегда ассоциируют именно с компанией Tuya. Очень много китайских компаний выпускают свои изделия, в сердце которых лежит платформа Tuya. Вот весь этот \"зоопарк\" и принято называть Tuya."
}, {
  "Author" : "JBFW",
  "Name" : "Улучшаем систему видеонаблюдения, ч.2",
  "Realise" : "Sat Jan 25 11:37:06 MSK 2025",
  "TimeToRead" : "4 мин",
  "Views" : "375",
  "ImgAddress" : "",
  "Rubriks" : [ "Умный дом" ],
  "Prehedder" : ""
}, {
  "Author" : "videoelektronic",
  "Name" : "Длины волн и энергии линий характеристического излучения (по элементам от Лития до Иттрия )",
  "Realise" : "Sat Jan 25 11:34:37 MSK 2025",
  "TimeToRead" : "2 мин",
  "Views" : "268",
  "ImgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/48e/b12/a6d/48eb12a6df926e74c92ade5966ab496b.jpg",
  "Rubriks" : [ "Научно-популярное" ],
  "Prehedder" : "Когда-то из ру-нета был доступ к вражескому сайту, где была выложена глава «Энциклопедии химика-технолога», посвящённая характеристическому рентгеновскому излучению. В этой энциклопедии я нашёл наиболее полную таблицу с информацией по длинам волн и энергиям рентгеновских фотонов излучения разных химических веществ. Потом доступ к этому сайту пропал, но я, в своё время, успел распечатать эту табличку на бумажный носитель. Теперь я решил заняться работой по выкладыванию данной информации в Сеть. Надеюсь, она будет полезна многим, кто интересуется темой рентгена. Для тех, кто совсем не в теме, поясню, что рентгеновское излучение бывает нескольких видов (по способу его генерации) - тормозное (за счёт резкого торможения электронов в аноде рентгеновской трубки), синхротронное (за счёт поворота потока электронов в магнитной системе синхротрона), характеристическое (за счёт излучения вещества под потоком электронов или фотонов в результате переходов электронов атомов из вышележащих уровней на вакантное место выбитых электронов). Отдельно можно ещё сказать, что гамма-излучение (т.е. электромагнитное излучение в результате ядерных реакций деления) тоже может лежать в рентгеновском спектре, а так же тепловое излучение может простираться в рентгеновский диапазон длин волн. Характеристическое излучение излучается рентгеновской трубкой в том случае, если энергии первичных (т.е. излучённых катодом и ускоренных электрическим полем электронов) достаточно для выбивания собственных электронов атомов мишени. Обычно можно считать, что пики характеристического излучения возникают в рентгеновской трубке тогда, когда энергия, переданная первичным электронам электрическим полем между её катодом и анодом (напряжение катод-анод) становится больше уровня характеристической энергии того или иного пика излучения."
}, {
  "Author" : "BOTCODERS",
  "Name" : "Получение информации о системе с помощью Python",
  "Realise" : "Sat Jan 25 11:20:01 MSK 2025",
  "TimeToRead" : "5 мин",
  "Views" : "584",
  "ImgAddress" : "",
  "Rubriks" : [ "Системное администрирование*", "Python*" ],
  "Prehedder" : ""
}, {
  "Author" : "RoboForm",
  "Name" : "Мобильная разработка за неделю #567 (2 — 8 декабря)",
  "Realise" : "Sat Jan 25 11:07:02 MSK 2025",
  "TimeToRead" : "4 мин",
  "Views" : "192",
  "ImgAddress" : "",
  "Rubriks" : [ "Монетизация мобильных приложений*", "Разработка под Android*", "Разработка под iOS*" ],
  "Prehedder" : ""
}, {
  "Author" : "tmplts",
  "Name" : "Управление проектами: дайджест публикаций #22",
  "Realise" : "Sat Jan 25 10:48:45 MSK 2025",
  "TimeToRead" : "8 мин",
  "Views" : "203",
  "ImgAddress" : "https://habrastorage.org/r/w1560/getpro/habr/upload_files/470/d45/f5c/470d45f5cb848c595b44dea2d8ac07d0.png",
  "Rubriks" : [ "Управление проектами*" ],
  "Prehedder" : "USM, НеЖелательные Явления, ненужная документация, допущения и ограничения, тупиковый путь в тимлиды, красные флаги при трудоустройстве и всё интересное, что писали на этой неделе про управление проектами. Мы прочитали все публикации и выбрали для вас самые крутые и полезные. Читайте, сохраняйте и применяйте!"
}, {
  "Author" : "Adm1ngmz",
  "Name" : "Анализ аккаунтов Telegram",
  "Realise" : "Sat Jan 25 10:45:34 MSK 2025",
  "TimeToRead" : "4 мин",
  "Views" : "538",
  "ImgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/e14/5fe/7c3/e145fe7c3d99ce9767510bc496b04df4.jpg",
  "Rubriks" : [ "Информационная безопасность*", "Геоинформационные сервисы*" ],
  "Prehedder" : "Приветствуем снова дорогих читателей! Продолжаем цикл статей \"ШХ\" и сегодня нашим блюдом будет Telegram. В ранних статьях мы рассмотрели способы аккаунтов целевого пользователя по его никнейму, после чего проводили разведку его аккаунта в социальной сети Вконтакте. На данном этапе мы ставим для себя важным узнать номер телефона пользователя, т.к. от номера уже можно будет неплохо отталкиваться в разведке и номер телефона может поведать о ещё подробней о своём владельце. В прошлой статье мы пытались выяснить номер при помощи страницы Вконтакте, а в этой как уже догадались по названию, мы будем пытаться выяснить как можно больше информации об аккаунте Telegram. Данный материал отредактирован и опубликован повторно, в связи в блокировкой прошлого материала РКН на территории РФ. Дисклеймер: Все данные предоставленные в этой статье взяты из открытых источников. Не призывают к действию и размещены только лишь для ознакомления и изучения механизмов используемых технологий."
}, {
  "Author" : "fcrng",
  "Name" : "Вопросы к UI. Вступление",
  "Realise" : "Sat Jan 25 10:14:43 MSK 2025",
  "TimeToRead" : "9 мин",
  "Views" : "496",
  "ImgAddress" : "https://habrastorage.org/r/w1560/getpro/habr/upload_files/5ce/2e1/145/5ce2e1145020083d68cbe2060ba12a7b.png",
  "Rubriks" : [ "Интерфейсы*", "Веб-разработка*", "JavaScript*" ],
  "Prehedder" : "Не знаю как до вас донести это, и насколько осторожно следует подбирать слова. Мне больно от того, как сейчас происходит создание пользовательских интерфейсов, а существующие подходы кажутся каким‑то недоразумением. И поймите, речь обо всех платформах — веб, мобилки, десктоп. Будучи разработчиком, и исследуя «новые» способы реализации UI, сквозь годы опыта смотришь на все это дело с тяжелым вздохом, мотаешь головой из стороны в сторону, и все что хочется — захлопнуть крышку ноутбука и заняться чем‑то другим. А сталкиваясь с этим изо дня в день на работе — не знаю, как мы не кричим от этого, правда не знаю. И нет, не стану говорить о том, что текущие инструменты не работают, это неправда. Приложив достаточное количество усилий, и да, возможно, несколько раз ударив себя же по лицу, вы с их помощью выполните все или почти все возложенные на вас задачи. Вопрос лишь в том — какой ценой."
}, {
  "Author" : "Seleditor",
  "Name" : "Мини-ПК декабря 2024: лучшие новинки месяца. Что предлагают производители?",
  "Realise" : "Sat Jan 25 10:09:11 MSK 2025",
  "TimeToRead" : "4 мин",
  "Views" : "2.4K",
  "ImgAddress" : "",
  "Rubriks" : [ "Блог компании Selectel", "Гаджеты", "Компьютерное железо" ],
  "Prehedder" : ""
}, {
  "Author" : "ramayasket",
  "Name" : "Математические бланки // Часть 3: математическая реальность",
  "Realise" : "Sat Jan 25 09:41:02 MSK 2025",
  "TimeToRead" : "15 мин",
  "Views" : "495",
  "ImgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/466/173/8eb/4661738ebbb886823abf3a78e281beca.jpg",
  "Rubriks" : [ "Программирование*", "Математика*", "Искусственный интеллект" ],
  "Prehedder" : "В первой части этой серии мы описали проблему математических бланков, и перспективные результаты её решения. Вторая часть показала, что эта проблема упирается в вопрос экземпляров. Он, в свою очередь, может быть решён в рамках модели идеального мира, который должен обладать памятью. Чтобы подступиться к теме памяти идеального мира, нам нужно с максимальной подробностью разобраться, что такое вообще память, какая она бывает, какие функции выполняет, какими характеристиками обладает, привести подтверждающие примеры. Исследование низшей математики - это 90% ожидания, 9% отчаяния, и только 1% озарения. Здесь, опустив 99%, можно сразу узнать результат. И в результате, памятью окажется то, что гораздо старше и математики, и самой человеческой истории. И оно всё это время перед глазами. Вот уж точно, хочешь спрятать, прячь на самом виду. Хотите узнать, что это? Не переключайтесь."
}, {
  "Author" : "Deevilleto",
  "Name" : "Умная система обучения для детей до 3 лет. Animal Island Aila",
  "Realise" : "Sat Jan 25 09:37:00 MSK 2025",
  "TimeToRead" : "5 мин",
  "Views" : "123",
  "ImgAddress" : "https://habrastorage.org/r/w1560/getpro/habr/upload_files/6e2/50f/da9/6e250fda9ead8f74430e97e0a54a6dec.png",
  "Rubriks" : [ "Разработка мобильных приложений*", "Разработка под Android*", "Разработка под iOS*", "Облачные сервисы*" ],
  "Prehedder" : "В современном мире технологии играют всё более важную роль в обучении и развитии детей. Проект \"Animal Island Aila\" — это инновационная умная система, созданная специально для малышей от 12 до 36 месяцев. Она помогает детям познакомиться с основами английского языка (цвета, формы, буквы), расширяет словарный запас и делает процесс обучения увлекательным. В 2019 году я имел возможность участвовать в разработке этой системы. Моя задача заключалась в создании как серверной, так и клиентской части проекта. Суть проекта Проект \"Animal Island Aila\" реализован на основе клиент-серверной архитектуры и включает два отдельных приложения: одно для детей, а другое для родителей. В качестве сервера используется облачная платформа Amazon Web Services. Приложение для детей, разработанное на Kotlin, работает на специальном Android-планшете Aila Sit & Play™. Оно демонстрирует различные обучающие видео, рассказы и колыбельные для детей. Приложение для родителей, разработанное на Flutter и Dart, доступно для платформ Android и iOS. Оно позволяет родителям управлять детским устройством и наблюдать за детьми в реальном времени. Архитектура серверной части Серверная часть проекта реализована с использованием AWS Serverless, набора облачных услуг от Amazon, позволяющих разработчикам создавать и управлять приложениями без необходимости обслуживания физических серверов. Основные преимущества этой технологии включают автоматическое масштабирование, оплату только за фактическое использование ресурсов и упрощенное развертывание приложений."
}, {
  "Author" : "andreybrylb",
  "Name" : "Сквозь губку Менгера. Как старшеклассники решают вековые задачи фрактальной топологии",
  "Realise" : "Sat Jan 25 09:34:52 MSK 2025",
  "TimeToRead" : "7 мин",
  "Views" : "587",
  "ImgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/c20/c4a/39d/c20c4a39d01779f10e8612c53830d414.jpg",
  "Rubriks" : [ "Математика*", "Научно-популярное" ],
  "Prehedder" : "Осенью 2021 года Малорс Эспиноза решил создать особенную математическую задачу. Она должна была быть достаточно сложной, чтобы стимулировать размышления и вызывать интерес к её решению, но при этом оставаться доступной для старшеклассников. Малорс, будучи аспирантом по математике в Университете Торонто, столкнулся с этим дополнительным вызовом. В течение нескольких лет он организовывал летние семинары для местных школьников, знакомя их с основами математических исследований и обучая писать доказательства. Некоторые ученики проявляли интерес к более глубокому пониманию математики — к задачам, где нет очевидного ответа. Им требовался правильный вопрос, чтобы направить их интерес. Такой вопрос Малорс нашёл, изучая учебник по теории хаоса. Там он наткнулся на знакомый объект — фрактал под названием «губка Менгера». Этот самоподобный объект строится по простому, но изящному принципу: сначала куб делится на части, подобные кубику Рубика. Затем удаляется центральный куб и центральные части каждой из шести граней. Этот процесс повторяется для оставшихся кубов снова и снова. С каждой итерацией структура становится всё более пористой, что и делает её похожей на губку."
}, {
  "Author" : "Keep_lookout",
  "Name" : "Как развлечься с моделями, если хочется чего-то необычного",
  "Realise" : "Sat Jan 25 09:21:55 MSK 2025",
  "TimeToRead" : "14 мин",
  "Views" : "447",
  "ImgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/a03/d98/706/a03d9870658bed3187786724f81d3750.jpg",
  "Rubriks" : [ "Машинное обучение*", "Искусственный интеллект", "Программирование*" ],
  "Prehedder" : "Написать эту статью меня побудило серьезное научное исследование, которое обосновало прекрасный и оригинальный метод Chain of Code (CoC) улучшения рассуждений моделей и точности их ответов. Суть метода заключается в том, чтобы заставить модель написать подходящий программный код, соответствующий поставленной в промпте задаче, интерпретировать его выполнение и на основе полученного результата сформировать более логичный, точный и достоверный ответ. Метод особенно хорошо работает в логических и математических задачах и я считаю, что он заслуживает пристального внимания программистов, как оригинальный и эффективный подход к решению различных хорошо структурированных задач. Я решил продемонстрировать его работу, но так, чтобы было интересно и не скучно. Поэтому предлагаю развлечься с моделями, а поскольку для нашей цели одной будет маловато, то давайте сразу с тремя."
}, {
  "Author" : "Bright_Translate",
  "Name" : "Элегантная математика фильтров Блума",
  "Realise" : "Sat Jan 25 09:13:00 MSK 2025",
  "TimeToRead" : "7 мин",
  "Views" : "750",
  "ImgAddress" : "",
  "Rubriks" : [ "Блог компании RUVDS.com", "Big Data*", "Алгоритмы*", "Математика*" ],
  "Prehedder" : ""
}, {
  "Author" : "shevchenko_a_d",
  "Name" : "Медианы чисел",
  "Realise" : "Sat Jan 25 08:42:19 MSK 2025",
  "TimeToRead" : "3 мин",
  "Views" : "431",
  "ImgAddress" : "",
  "Rubriks" : [ "C++*", "Алгоритмы*" ],
  "Prehedder" : ""
}, {
  "Author" : "integralik",
  "Name" : "Базовое программирование, или Почему джуны не могут пройти к нам собеседование",
  "Realise" : "Sat Jan 25 08:24:45 MSK 2025",
  "TimeToRead" : "8 мин",
  "Views" : "4.4K",
  "ImgAddress" : "",
  "Rubriks" : [ "JavaScript*", "PHP*", "Карьера в IT-индустрии" ],
  "Prehedder" : ""
}, {
  "Author" : "igor_zvyagin",
  "Name" : "Как вырваться из матрицы? Мнение программиста",
  "Realise" : "Sat Jan 25 08:09:03 MSK 2025",
  "TimeToRead" : "8 мин",
  "Views" : "807",
  "ImgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/2c7/d26/f3c/2c7d26f3cbe1a276324df9a1edaec2fc.jpeg",
  "Rubriks" : [ "Чулан" ],
  "Prehedder" : "Некоторое время назад возмутил Хабр статьей про то, что убежден - мы находимся в симуляции. Было много как позитивных, так и негативных отзывов. Статью даже пытались заблокировать, (возможно, из-за вмешательства «администраторов Матрицы»), вторую часть, так и не пропустили. Было много вопросов, в чем смысл симуляции, если она действительно существует. Другими словами, в чем смысл жизни? Позволю себе посветить в определенную сторону, на то, что уже на виду, на то, что уже происходит. Как мне кажется, мы с вами на пороге создания собственной симуляции. Может не с технической точки зрения, но запрос на создание симуляции уже витает в воздухе."
}, {
  "Author" : "OldfagGamer",
  "Name" : "Ностальгические игры: Far Cry",
  "Realise" : "Sat Jan 25 07:05:29 MSK 2025",
  "TimeToRead" : "14 мин",
  "Views" : "1.9K",
  "ImgAddress" : "",
  "Rubriks" : [ "Блог компании Timeweb Cloud", "Игры и игровые консоли", "Разработка игр*", "Читальный зал" ],
  "Prehedder" : ""
}, {
  "Author" : "gonzazoid",
  "Name" : "Ultimatum — еще один форк хромиума, с претензией…",
  "Realise" : "Sat Jan 25 14:04:54 MSK 2025",
  "TimeToRead" : "10 мин",
  "Views" : "36",
  "ImgAddress" : "",
  "Rubriks" : [ "C++*", "JavaScript*", "Open source*", "Браузеры", "Расширения для браузеров" ],
  "Prehedder" : ""
}, {
  "Author" : "myoffice_ru",
  "Name" : "Тривиальное перемещение и рефлексия: реализуем фичу из C++26 в библиотеке",
  "Realise" : "Sat Jan 25 12:41:47 MSK 2025",
  "TimeToRead" : "8 мин",
  "Views" : "360",
  "ImgAddress" : "https://habrastorage.org/getpro/habr/upload_files/97d/e40/35e/97de4035eea962eeb53f1719dc5b97e6.PNG",
  "Rubriks" : [ "Блог компании МойОфис", "C++*", "Программирование*" ],
  "Prehedder" : "В статье разработчик Барри Ревзин* объясняет, как можно определить и проверить свойства типов для обеспечения тривиального перемещения, разбирая нюансы эффективности, удобства и точности реализации. Основная проблема здесь в необходимости учёта всех особенностей типов, включая пользовательские функции, наследование и перегрузку. Это требует как сложных эвристик, так и новых инструментов языка. Под катом вы найдёте решение с аннотациями и механизмами рефлексии для создания гибкой и относительно компактной реализации. Автор показывает потенциал рефлексии в автоматизации задач, которые ранее требовали дополнительных усилий, и демонстрирует возможности для улучшения библиотек и кода на C++. *Обращаем ваше внимание, что позиция автора может не всегда совпадать с мнением МойОфис"
}, {
  "Author" : "Slacky1965",
  "Name" : "Перепрограммируем заводской термостат Zigbee для теплого пола от компании Tuya",
  "Realise" : "Sat Jan 25 11:56:12 MSK 2025",
  "TimeToRead" : "10 мин",
  "Views" : "941",
  "ImgAddress" : "https://habrastorage.org/r/w1560/getpro/habr/upload_files/39f/2e2/240/39f2e22409095ba29acb739c12e21773.png",
  "Rubriks" : [ "C*", "Беспроводные технологии*", "Программирование микроконтроллеров*", "Разработка для интернета вещей*", "Умный дом" ],
  "Prehedder" : "Автор не несет ответственности, если данная статья сделает из вашего умного термостата полоумный. Для пользователей умных домов, которые строят свои системы на протоколе Zigbee, название Tuya знакомо, как никогда. Причем в последнее время название Tuya не всегда ассоциируют именно с компанией Tuya. Очень много китайских компаний выпускают свои изделия, в сердце которых лежит платформа Tuya. Вот весь этот \"зоопарк\" и принято называть Tuya."
}, {
  "Author" : "JBFW",
  "Name" : "Улучшаем систему видеонаблюдения, ч.2",
  "Realise" : "Sat Jan 25 11:37:06 MSK 2025",
  "TimeToRead" : "4 мин",
  "Views" : "375",
  "ImgAddress" : "",
  "Rubriks" : [ "Умный дом" ],
  "Prehedder" : ""
}, {
  "Author" : "videoelektronic",
  "Name" : "Длины волн и энергии линий характеристического излучения (по элементам от Лития до Иттрия )",
  "Realise" : "Sat Jan 25 11:34:37 MSK 2025",
  "TimeToRead" : "2 мин",
  "Views" : "268",
  "ImgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/48e/b12/a6d/48eb12a6df926e74c92ade5966ab496b.jpg",
  "Rubriks" : [ "Научно-популярное" ],
  "Prehedder" : "Когда-то из ру-нета был доступ к вражескому сайту, где была выложена глава «Энциклопедии химика-технолога», посвящённая характеристическому рентгеновскому излучению. В этой энциклопедии я нашёл наиболее полную таблицу с информацией по длинам волн и энергиям рентгеновских фотонов излучения разных химических веществ. Потом доступ к этому сайту пропал, но я, в своё время, успел распечатать эту табличку на бумажный носитель. Теперь я решил заняться работой по выкладыванию данной информации в Сеть. Надеюсь, она будет полезна многим, кто интересуется темой рентгена. Для тех, кто совсем не в теме, поясню, что рентгеновское излучение бывает нескольких видов (по способу его генерации) - тормозное (за счёт резкого торможения электронов в аноде рентгеновской трубки), синхротронное (за счёт поворота потока электронов в магнитной системе синхротрона), характеристическое (за счёт излучения вещества под потоком электронов или фотонов в результате переходов электронов атомов из вышележащих уровней на вакантное место выбитых электронов). Отдельно можно ещё сказать, что гамма-излучение (т.е. электромагнитное излучение в результате ядерных реакций деления) тоже может лежать в рентгеновском спектре, а так же тепловое излучение может простираться в рентгеновский диапазон длин волн. Характеристическое излучение излучается рентгеновской трубкой в том случае, если энергии первичных (т.е. излучённых катодом и ускоренных электрическим полем электронов) достаточно для выбивания собственных электронов атомов мишени. Обычно можно считать, что пики характеристического излучения возникают в рентгеновской трубке тогда, когда энергия, переданная первичным электронам электрическим полем между её катодом и анодом (напряжение катод-анод) становится больше уровня характеристической энергии того или иного пика излучения."
}, {
  "Author" : "BOTCODERS",
  "Name" : "Получение информации о системе с помощью Python",
  "Realise" : "Sat Jan 25 11:20:01 MSK 2025",
  "TimeToRead" : "5 мин",
  "Views" : "584",
  "ImgAddress" : "",
  "Rubriks" : [ "Системное администрирование*", "Python*" ],
  "Prehedder" : ""
}, {
  "Author" : "RoboForm",
  "Name" : "Мобильная разработка за неделю #567 (2 — 8 декабря)",
  "Realise" : "Sat Jan 25 11:07:02 MSK 2025",
  "TimeToRead" : "4 мин",
  "Views" : "192",
  "ImgAddress" : "",
  "Rubriks" : [ "Монетизация мобильных приложений*", "Разработка под Android*", "Разработка под iOS*" ],
  "Prehedder" : ""
}, {
  "Author" : "tmplts",
  "Name" : "Управление проектами: дайджест публикаций #22",
  "Realise" : "Sat Jan 25 10:48:45 MSK 2025",
  "TimeToRead" : "8 мин",
  "Views" : "203",
  "ImgAddress" : "https://habrastorage.org/r/w1560/getpro/habr/upload_files/470/d45/f5c/470d45f5cb848c595b44dea2d8ac07d0.png",
  "Rubriks" : [ "Управление проектами*" ],
  "Prehedder" : "USM, НеЖелательные Явления, ненужная документация, допущения и ограничения, тупиковый путь в тимлиды, красные флаги при трудоустройстве и всё интересное, что писали на этой неделе про управление проектами. Мы прочитали все публикации и выбрали для вас самые крутые и полезные. Читайте, сохраняйте и применяйте!"
}, {
  "Author" : "Adm1ngmz",
  "Name" : "Анализ аккаунтов Telegram",
  "Realise" : "Sat Jan 25 10:45:34 MSK 2025",
  "TimeToRead" : "4 мин",
  "Views" : "538",
  "ImgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/e14/5fe/7c3/e145fe7c3d99ce9767510bc496b04df4.jpg",
  "Rubriks" : [ "Информационная безопасность*", "Геоинформационные сервисы*" ],
  "Prehedder" : "Приветствуем снова дорогих читателей! Продолжаем цикл статей \"ШХ\" и сегодня нашим блюдом будет Telegram. В ранних статьях мы рассмотрели способы аккаунтов целевого пользователя по его никнейму, после чего проводили разведку его аккаунта в социальной сети Вконтакте. На данном этапе мы ставим для себя важным узнать номер телефона пользователя, т.к. от номера уже можно будет неплохо отталкиваться в разведке и номер телефона может поведать о ещё подробней о своём владельце. В прошлой статье мы пытались выяснить номер при помощи страницы Вконтакте, а в этой как уже догадались по названию, мы будем пытаться выяснить как можно больше информации об аккаунте Telegram. Данный материал отредактирован и опубликован повторно, в связи в блокировкой прошлого материала РКН на территории РФ. Дисклеймер: Все данные предоставленные в этой статье взяты из открытых источников. Не призывают к действию и размещены только лишь для ознакомления и изучения механизмов используемых технологий."
}, {
  "Author" : "fcrng",
  "Name" : "Вопросы к UI. Вступление",
  "Realise" : "Sat Jan 25 10:14:43 MSK 2025",
  "TimeToRead" : "9 мин",
  "Views" : "496",
  "ImgAddress" : "https://habrastorage.org/r/w1560/getpro/habr/upload_files/5ce/2e1/145/5ce2e1145020083d68cbe2060ba12a7b.png",
  "Rubriks" : [ "Интерфейсы*", "Веб-разработка*", "JavaScript*" ],
  "Prehedder" : "Не знаю как до вас донести это, и насколько осторожно следует подбирать слова. Мне больно от того, как сейчас происходит создание пользовательских интерфейсов, а существующие подходы кажутся каким‑то недоразумением. И поймите, речь обо всех платформах — веб, мобилки, десктоп. Будучи разработчиком, и исследуя «новые» способы реализации UI, сквозь годы опыта смотришь на все это дело с тяжелым вздохом, мотаешь головой из стороны в сторону, и все что хочется — захлопнуть крышку ноутбука и заняться чем‑то другим. А сталкиваясь с этим изо дня в день на работе — не знаю, как мы не кричим от этого, правда не знаю. И нет, не стану говорить о том, что текущие инструменты не работают, это неправда. Приложив достаточное количество усилий, и да, возможно, несколько раз ударив себя же по лицу, вы с их помощью выполните все или почти все возложенные на вас задачи. Вопрос лишь в том — какой ценой."
}, {
  "Author" : "Seleditor",
  "Name" : "Мини-ПК декабря 2024: лучшие новинки месяца. Что предлагают производители?",
  "Realise" : "Sat Jan 25 10:09:11 MSK 2025",
  "TimeToRead" : "4 мин",
  "Views" : "2.4K",
  "ImgAddress" : "",
  "Rubriks" : [ "Блог компании Selectel", "Гаджеты", "Компьютерное железо" ],
  "Prehedder" : ""
}, {
  "Author" : "ramayasket",
  "Name" : "Математические бланки // Часть 3: математическая реальность",
  "Realise" : "Sat Jan 25 09:41:02 MSK 2025",
  "TimeToRead" : "15 мин",
  "Views" : "495",
  "ImgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/466/173/8eb/4661738ebbb886823abf3a78e281beca.jpg",
  "Rubriks" : [ "Программирование*", "Математика*", "Искусственный интеллект" ],
  "Prehedder" : "В первой части этой серии мы описали проблему математических бланков, и перспективные результаты её решения. Вторая часть показала, что эта проблема упирается в вопрос экземпляров. Он, в свою очередь, может быть решён в рамках модели идеального мира, который должен обладать памятью. Чтобы подступиться к теме памяти идеального мира, нам нужно с максимальной подробностью разобраться, что такое вообще память, какая она бывает, какие функции выполняет, какими характеристиками обладает, привести подтверждающие примеры. Исследование низшей математики - это 90% ожидания, 9% отчаяния, и только 1% озарения. Здесь, опустив 99%, можно сразу узнать результат. И в результате, памятью окажется то, что гораздо старше и математики, и самой человеческой истории. И оно всё это время перед глазами. Вот уж точно, хочешь спрятать, прячь на самом виду. Хотите узнать, что это? Не переключайтесь."
}, {
  "Author" : "Deevilleto",
  "Name" : "Умная система обучения для детей до 3 лет. Animal Island Aila",
  "Realise" : "Sat Jan 25 09:37:00 MSK 2025",
  "TimeToRead" : "5 мин",
  "Views" : "123",
  "ImgAddress" : "https://habrastorage.org/r/w1560/getpro/habr/upload_files/6e2/50f/da9/6e250fda9ead8f74430e97e0a54a6dec.png",
  "Rubriks" : [ "Разработка мобильных приложений*", "Разработка под Android*", "Разработка под iOS*", "Облачные сервисы*" ],
  "Prehedder" : "В современном мире технологии играют всё более важную роль в обучении и развитии детей. Проект \"Animal Island Aila\" — это инновационная умная система, созданная специально для малышей от 12 до 36 месяцев. Она помогает детям познакомиться с основами английского языка (цвета, формы, буквы), расширяет словарный запас и делает процесс обучения увлекательным. В 2019 году я имел возможность участвовать в разработке этой системы. Моя задача заключалась в создании как серверной, так и клиентской части проекта. Суть проекта Проект \"Animal Island Aila\" реализован на основе клиент-серверной архитектуры и включает два отдельных приложения: одно для детей, а другое для родителей. В качестве сервера используется облачная платформа Amazon Web Services. Приложение для детей, разработанное на Kotlin, работает на специальном Android-планшете Aila Sit & Play™. Оно демонстрирует различные обучающие видео, рассказы и колыбельные для детей. Приложение для родителей, разработанное на Flutter и Dart, доступно для платформ Android и iOS. Оно позволяет родителям управлять детским устройством и наблюдать за детьми в реальном времени. Архитектура серверной части Серверная часть проекта реализована с использованием AWS Serverless, набора облачных услуг от Amazon, позволяющих разработчикам создавать и управлять приложениями без необходимости обслуживания физических серверов. Основные преимущества этой технологии включают автоматическое масштабирование, оплату только за фактическое использование ресурсов и упрощенное развертывание приложений."
}, {
  "Author" : "andreybrylb",
  "Name" : "Сквозь губку Менгера. Как старшеклассники решают вековые задачи фрактальной топологии",
  "Realise" : "Sat Jan 25 09:34:52 MSK 2025",
  "TimeToRead" : "7 мин",
  "Views" : "587",
  "ImgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/c20/c4a/39d/c20c4a39d01779f10e8612c53830d414.jpg",
  "Rubriks" : [ "Математика*", "Научно-популярное" ],
  "Prehedder" : "Осенью 2021 года Малорс Эспиноза решил создать особенную математическую задачу. Она должна была быть достаточно сложной, чтобы стимулировать размышления и вызывать интерес к её решению, но при этом оставаться доступной для старшеклассников. Малорс, будучи аспирантом по математике в Университете Торонто, столкнулся с этим дополнительным вызовом. В течение нескольких лет он организовывал летние семинары для местных школьников, знакомя их с основами математических исследований и обучая писать доказательства. Некоторые ученики проявляли интерес к более глубокому пониманию математики — к задачам, где нет очевидного ответа. Им требовался правильный вопрос, чтобы направить их интерес. Такой вопрос Малорс нашёл, изучая учебник по теории хаоса. Там он наткнулся на знакомый объект — фрактал под названием «губка Менгера». Этот самоподобный объект строится по простому, но изящному принципу: сначала куб делится на части, подобные кубику Рубика. Затем удаляется центральный куб и центральные части каждой из шести граней. Этот процесс повторяется для оставшихся кубов снова и снова. С каждой итерацией структура становится всё более пористой, что и делает её похожей на губку."
}, {
  "Author" : "Keep_lookout",
  "Name" : "Как развлечься с моделями, если хочется чего-то необычного",
  "Realise" : "Sat Jan 25 09:21:55 MSK 2025",
  "TimeToRead" : "14 мин",
  "Views" : "447",
  "ImgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/a03/d98/706/a03d9870658bed3187786724f81d3750.jpg",
  "Rubriks" : [ "Машинное обучение*", "Искусственный интеллект", "Программирование*" ],
  "Prehedder" : "Написать эту статью меня побудило серьезное научное исследование, которое обосновало прекрасный и оригинальный метод Chain of Code (CoC) улучшения рассуждений моделей и точности их ответов. Суть метода заключается в том, чтобы заставить модель написать подходящий программный код, соответствующий поставленной в промпте задаче, интерпретировать его выполнение и на основе полученного результата сформировать более логичный, точный и достоверный ответ. Метод особенно хорошо работает в логических и математических задачах и я считаю, что он заслуживает пристального внимания программистов, как оригинальный и эффективный подход к решению различных хорошо структурированных задач. Я решил продемонстрировать его работу, но так, чтобы было интересно и не скучно. Поэтому предлагаю развлечься с моделями, а поскольку для нашей цели одной будет маловато, то давайте сразу с тремя."
}, {
  "Author" : "Bright_Translate",
  "Name" : "Элегантная математика фильтров Блума",
  "Realise" : "Sat Jan 25 09:13:00 MSK 2025",
  "TimeToRead" : "7 мин",
  "Views" : "750",
  "ImgAddress" : "",
  "Rubriks" : [ "Блог компании RUVDS.com", "Big Data*", "Алгоритмы*", "Математика*" ],
  "Prehedder" : ""
}, {
  "Author" : "shevchenko_a_d",
  "Name" : "Медианы чисел",
  "Realise" : "Sat Jan 25 08:42:19 MSK 2025",
  "TimeToRead" : "3 мин",
  "Views" : "431",
  "ImgAddress" : "",
  "Rubriks" : [ "C++*", "Алгоритмы*" ],
  "Prehedder" : ""
}, {
  "Author" : "integralik",
  "Name" : "Базовое программирование, или Почему джуны не могут пройти к нам собеседование",
  "Realise" : "Sat Jan 25 08:24:45 MSK 2025",
  "TimeToRead" : "8 мин",
  "Views" : "4.4K",
  "ImgAddress" : "",
  "Rubriks" : [ "JavaScript*", "PHP*", "Карьера в IT-индустрии" ],
  "Prehedder" : ""
}, {
  "Author" : "igor_zvyagin",
  "Name" : "Как вырваться из матрицы? Мнение программиста",
  "Realise" : "Sat Jan 25 08:09:03 MSK 2025",
  "TimeToRead" : "8 мин",
  "Views" : "807",
  "ImgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/2c7/d26/f3c/2c7d26f3cbe1a276324df9a1edaec2fc.jpeg",
  "Rubriks" : [ "Чулан" ],
  "Prehedder" : "Некоторое время назад возмутил Хабр статьей про то, что убежден - мы находимся в симуляции. Было много как позитивных, так и негативных отзывов. Статью даже пытались заблокировать, (возможно, из-за вмешательства «администраторов Матрицы»), вторую часть, так и не пропустили. Было много вопросов, в чем смысл симуляции, если она действительно существует. Другими словами, в чем смысл жизни? Позволю себе посветить в определенную сторону, на то, что уже на виду, на то, что уже происходит. Как мне кажется, мы с вами на пороге создания собственной симуляции. Может не с технической точки зрения, но запрос на создание симуляции уже витает в воздухе."
}, {
  "Author" : "OldfagGamer",
  "Name" : "Ностальгические игры: Far Cry",
  "Realise" : "Sat Jan 25 07:05:29 MSK 2025",
  "TimeToRead" : "14 мин",
  "Views" : "1.9K",
  "ImgAddress" : "",
  "Rubriks" : [ "Блог компании Timeweb Cloud", "Игры и игровые консоли", "Разработка игр*", "Читальный зал" ],
  "Prehedder" : ""
}, {
  "Author" : "gonzazoid",
  "Name" : "Ultimatum — еще один форк хромиума, с претензией…",
  "Realise" : "Sat Jan 25 14:04:54 MSK 2025",
  "TimeToRead" : "10 мин",
  "Views" : "36",
  "ImgAddress" : "",
  "Rubriks" : [ "C++*", "JavaScript*", "Open source*", "Браузеры", "Расширения для браузеров" ],
  "Prehedder" : ""
}, {
  "Author" : "myoffice_ru",
  "Name" : "Тривиальное перемещение и рефлексия: реализуем фичу из C++26 в библиотеке",
  "Realise" : "Sat Jan 25 12:41:47 MSK 2025",
  "TimeToRead" : "8 мин",
  "Views" : "360",
  "ImgAddress" : "https://habrastorage.org/getpro/habr/upload_files/97d/e40/35e/97de4035eea962eeb53f1719dc5b97e6.PNG",
  "Rubriks" : [ "Блог компании МойОфис", "C++*", "Программирование*" ],
  "Prehedder" : "В статье разработчик Барри Ревзин* объясняет, как можно определить и проверить свойства типов для обеспечения тривиального перемещения, разбирая нюансы эффективности, удобства и точности реализации. Основная проблема здесь в необходимости учёта всех особенностей типов, включая пользовательские функции, наследование и перегрузку. Это требует как сложных эвристик, так и новых инструментов языка. Под катом вы найдёте решение с аннотациями и механизмами рефлексии для создания гибкой и относительно компактной реализации. Автор показывает потенциал рефлексии в автоматизации задач, которые ранее требовали дополнительных усилий, и демонстрирует возможности для улучшения библиотек и кода на C++. *Обращаем ваше внимание, что позиция автора может не всегда совпадать с мнением МойОфис"
}, {
  "Author" : "Slacky1965",
  "Name" : "Перепрограммируем заводской термостат Zigbee для теплого пола от компании Tuya",
  "Realise" : "Sat Jan 25 11:56:12 MSK 2025",
  "TimeToRead" : "10 мин",
  "Views" : "941",
  "ImgAddress" : "https://habrastorage.org/r/w1560/getpro/habr/upload_files/39f/2e2/240/39f2e22409095ba29acb739c12e21773.png",
  "Rubriks" : [ "C*", "Беспроводные технологии*", "Программирование микроконтроллеров*", "Разработка для интернета вещей*", "Умный дом" ],
  "Prehedder" : "Автор не несет ответственности, если данная статья сделает из вашего умного термостата полоумный. Для пользователей умных домов, которые строят свои системы на протоколе Zigbee, название Tuya знакомо, как никогда. Причем в последнее время название Tuya не всегда ассоциируют именно с компанией Tuya. Очень много китайских компаний выпускают свои изделия, в сердце которых лежит платформа Tuya. Вот весь этот \"зоопарк\" и принято называть Tuya."
}, {
  "Author" : "JBFW",
  "Name" : "Улучшаем систему видеонаблюдения, ч.2",
  "Realise" : "Sat Jan 25 11:37:06 MSK 2025",
  "TimeToRead" : "4 мин",
  "Views" : "375",
  "ImgAddress" : "",
  "Rubriks" : [ "Умный дом" ],
  "Prehedder" : ""
}, {
  "Author" : "videoelektronic",
  "Name" : "Длины волн и энергии линий характеристического излучения (по элементам от Лития до Иттрия )",
  "Realise" : "Sat Jan 25 11:34:37 MSK 2025",
  "TimeToRead" : "2 мин",
  "Views" : "268",
  "ImgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/48e/b12/a6d/48eb12a6df926e74c92ade5966ab496b.jpg",
  "Rubriks" : [ "Научно-популярное" ],
  "Prehedder" : "Когда-то из ру-нета был доступ к вражескому сайту, где была выложена глава «Энциклопедии химика-технолога», посвящённая характеристическому рентгеновскому излучению. В этой энциклопедии я нашёл наиболее полную таблицу с информацией по длинам волн и энергиям рентгеновских фотонов излучения разных химических веществ. Потом доступ к этому сайту пропал, но я, в своё время, успел распечатать эту табличку на бумажный носитель. Теперь я решил заняться работой по выкладыванию данной информации в Сеть. Надеюсь, она будет полезна многим, кто интересуется темой рентгена. Для тех, кто совсем не в теме, поясню, что рентгеновское излучение бывает нескольких видов (по способу его генерации) - тормозное (за счёт резкого торможения электронов в аноде рентгеновской трубки), синхротронное (за счёт поворота потока электронов в магнитной системе синхротрона), характеристическое (за счёт излучения вещества под потоком электронов или фотонов в результате переходов электронов атомов из вышележащих уровней на вакантное место выбитых электронов). Отдельно можно ещё сказать, что гамма-излучение (т.е. электромагнитное излучение в результате ядерных реакций деления) тоже может лежать в рентгеновском спектре, а так же тепловое излучение может простираться в рентгеновский диапазон длин волн. Характеристическое излучение излучается рентгеновской трубкой в том случае, если энергии первичных (т.е. излучённых катодом и ускоренных электрическим полем электронов) достаточно для выбивания собственных электронов атомов мишени. Обычно можно считать, что пики характеристического излучения возникают в рентгеновской трубке тогда, когда энергия, переданная первичным электронам электрическим полем между её катодом и анодом (напряжение катод-анод) становится больше уровня характеристической энергии того или иного пика излучения."
}, {
  "Author" : "BOTCODERS",
  "Name" : "Получение информации о системе с помощью Python",
  "Realise" : "Sat Jan 25 11:20:01 MSK 2025",
  "TimeToRead" : "5 мин",
  "Views" : "584",
  "ImgAddress" : "",
  "Rubriks" : [ "Системное администрирование*", "Python*" ],
  "Prehedder" : ""
}, {
  "Author" : "RoboForm",
  "Name" : "Мобильная разработка за неделю #567 (2 — 8 декабря)",
  "Realise" : "Sat Jan 25 11:07:02 MSK 2025",
  "TimeToRead" : "4 мин",
  "Views" : "192",
  "ImgAddress" : "",
  "Rubriks" : [ "Монетизация мобильных приложений*", "Разработка под Android*", "Разработка под iOS*" ],
  "Prehedder" : ""
}, {
  "Author" : "tmplts",
  "Name" : "Управление проектами: дайджест публикаций #22",
  "Realise" : "Sat Jan 25 10:48:45 MSK 2025",
  "TimeToRead" : "8 мин",
  "Views" : "203",
  "ImgAddress" : "https://habrastorage.org/r/w1560/getpro/habr/upload_files/470/d45/f5c/470d45f5cb848c595b44dea2d8ac07d0.png",
  "Rubriks" : [ "Управление проектами*" ],
  "Prehedder" : "USM, НеЖелательные Явления, ненужная документация, допущения и ограничения, тупиковый путь в тимлиды, красные флаги при трудоустройстве и всё интересное, что писали на этой неделе про управление проектами. Мы прочитали все публикации и выбрали для вас самые крутые и полезные. Читайте, сохраняйте и применяйте!"
}, {
  "Author" : "Adm1ngmz",
  "Name" : "Анализ аккаунтов Telegram",
  "Realise" : "Sat Jan 25 10:45:34 MSK 2025",
  "TimeToRead" : "4 мин",
  "Views" : "538",
  "ImgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/e14/5fe/7c3/e145fe7c3d99ce9767510bc496b04df4.jpg",
  "Rubriks" : [ "Информационная безопасность*", "Геоинформационные сервисы*" ],
  "Prehedder" : "Приветствуем снова дорогих читателей! Продолжаем цикл статей \"ШХ\" и сегодня нашим блюдом будет Telegram. В ранних статьях мы рассмотрели способы аккаунтов целевого пользователя по его никнейму, после чего проводили разведку его аккаунта в социальной сети Вконтакте. На данном этапе мы ставим для себя важным узнать номер телефона пользователя, т.к. от номера уже можно будет неплохо отталкиваться в разведке и номер телефона может поведать о ещё подробней о своём владельце. В прошлой статье мы пытались выяснить номер при помощи страницы Вконтакте, а в этой как уже догадались по названию, мы будем пытаться выяснить как можно больше информации об аккаунте Telegram. Данный материал отредактирован и опубликован повторно, в связи в блокировкой прошлого материала РКН на территории РФ. Дисклеймер: Все данные предоставленные в этой статье взяты из открытых источников. Не призывают к действию и размещены только лишь для ознакомления и изучения механизмов используемых технологий."
}, {
  "Author" : "fcrng",
  "Name" : "Вопросы к UI. Вступление",
  "Realise" : "Sat Jan 25 10:14:43 MSK 2025",
  "TimeToRead" : "9 мин",
  "Views" : "496",
  "ImgAddress" : "https://habrastorage.org/r/w1560/getpro/habr/upload_files/5ce/2e1/145/5ce2e1145020083d68cbe2060ba12a7b.png",
  "Rubriks" : [ "Интерфейсы*", "Веб-разработка*", "JavaScript*" ],
  "Prehedder" : "Не знаю как до вас донести это, и насколько осторожно следует подбирать слова. Мне больно от того, как сейчас происходит создание пользовательских интерфейсов, а существующие подходы кажутся каким‑то недоразумением. И поймите, речь обо всех платформах — веб, мобилки, десктоп. Будучи разработчиком, и исследуя «новые» способы реализации UI, сквозь годы опыта смотришь на все это дело с тяжелым вздохом, мотаешь головой из стороны в сторону, и все что хочется — захлопнуть крышку ноутбука и заняться чем‑то другим. А сталкиваясь с этим изо дня в день на работе — не знаю, как мы не кричим от этого, правда не знаю. И нет, не стану говорить о том, что текущие инструменты не работают, это неправда. Приложив достаточное количество усилий, и да, возможно, несколько раз ударив себя же по лицу, вы с их помощью выполните все или почти все возложенные на вас задачи. Вопрос лишь в том — какой ценой."
}, {
  "Author" : "Seleditor",
  "Name" : "Мини-ПК декабря 2024: лучшие новинки месяца. Что предлагают производители?",
  "Realise" : "Sat Jan 25 10:09:11 MSK 2025",
  "TimeToRead" : "4 мин",
  "Views" : "2.4K",
  "ImgAddress" : "",
  "Rubriks" : [ "Блог компании Selectel", "Гаджеты", "Компьютерное железо" ],
  "Prehedder" : ""
}, {
  "Author" : "ramayasket",
  "Name" : "Математические бланки // Часть 3: математическая реальность",
  "Realise" : "Sat Jan 25 09:41:02 MSK 2025",
  "TimeToRead" : "15 мин",
  "Views" : "495",
  "ImgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/466/173/8eb/4661738ebbb886823abf3a78e281beca.jpg",
  "Rubriks" : [ "Программирование*", "Математика*", "Искусственный интеллект" ],
  "Prehedder" : "В первой части этой серии мы описали проблему математических бланков, и перспективные результаты её решения. Вторая часть показала, что эта проблема упирается в вопрос экземпляров. Он, в свою очередь, может быть решён в рамках модели идеального мира, который должен обладать памятью. Чтобы подступиться к теме памяти идеального мира, нам нужно с максимальной подробностью разобраться, что такое вообще память, какая она бывает, какие функции выполняет, какими характеристиками обладает, привести подтверждающие примеры. Исследование низшей математики - это 90% ожидания, 9% отчаяния, и только 1% озарения. Здесь, опустив 99%, можно сразу узнать результат. И в результате, памятью окажется то, что гораздо старше и математики, и самой человеческой истории. И оно всё это время перед глазами. Вот уж точно, хочешь спрятать, прячь на самом виду. Хотите узнать, что это? Не переключайтесь."
}, {
  "Author" : "Deevilleto",
  "Name" : "Умная система обучения для детей до 3 лет. Animal Island Aila",
  "Realise" : "Sat Jan 25 09:37:00 MSK 2025",
  "TimeToRead" : "5 мин",
  "Views" : "123",
  "ImgAddress" : "https://habrastorage.org/r/w1560/getpro/habr/upload_files/6e2/50f/da9/6e250fda9ead8f74430e97e0a54a6dec.png",
  "Rubriks" : [ "Разработка мобильных приложений*", "Разработка под Android*", "Разработка под iOS*", "Облачные сервисы*" ],
  "Prehedder" : "В современном мире технологии играют всё более важную роль в обучении и развитии детей. Проект \"Animal Island Aila\" — это инновационная умная система, созданная специально для малышей от 12 до 36 месяцев. Она помогает детям познакомиться с основами английского языка (цвета, формы, буквы), расширяет словарный запас и делает процесс обучения увлекательным. В 2019 году я имел возможность участвовать в разработке этой системы. Моя задача заключалась в создании как серверной, так и клиентской части проекта. Суть проекта Проект \"Animal Island Aila\" реализован на основе клиент-серверной архитектуры и включает два отдельных приложения: одно для детей, а другое для родителей. В качестве сервера используется облачная платформа Amazon Web Services. Приложение для детей, разработанное на Kotlin, работает на специальном Android-планшете Aila Sit & Play™. Оно демонстрирует различные обучающие видео, рассказы и колыбельные для детей. Приложение для родителей, разработанное на Flutter и Dart, доступно для платформ Android и iOS. Оно позволяет родителям управлять детским устройством и наблюдать за детьми в реальном времени. Архитектура серверной части Серверная часть проекта реализована с использованием AWS Serverless, набора облачных услуг от Amazon, позволяющих разработчикам создавать и управлять приложениями без необходимости обслуживания физических серверов. Основные преимущества этой технологии включают автоматическое масштабирование, оплату только за фактическое использование ресурсов и упрощенное развертывание приложений."
}, {
  "Author" : "andreybrylb",
  "Name" : "Сквозь губку Менгера. Как старшеклассники решают вековые задачи фрактальной топологии",
  "Realise" : "Sat Jan 25 09:34:52 MSK 2025",
  "TimeToRead" : "7 мин",
  "Views" : "587",
  "ImgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/c20/c4a/39d/c20c4a39d01779f10e8612c53830d414.jpg",
  "Rubriks" : [ "Математика*", "Научно-популярное" ],
  "Prehedder" : "Осенью 2021 года Малорс Эспиноза решил создать особенную математическую задачу. Она должна была быть достаточно сложной, чтобы стимулировать размышления и вызывать интерес к её решению, но при этом оставаться доступной для старшеклассников. Малорс, будучи аспирантом по математике в Университете Торонто, столкнулся с этим дополнительным вызовом. В течение нескольких лет он организовывал летние семинары для местных школьников, знакомя их с основами математических исследований и обучая писать доказательства. Некоторые ученики проявляли интерес к более глубокому пониманию математики — к задачам, где нет очевидного ответа. Им требовался правильный вопрос, чтобы направить их интерес. Такой вопрос Малорс нашёл, изучая учебник по теории хаоса. Там он наткнулся на знакомый объект — фрактал под названием «губка Менгера». Этот самоподобный объект строится по простому, но изящному принципу: сначала куб делится на части, подобные кубику Рубика. Затем удаляется центральный куб и центральные части каждой из шести граней. Этот процесс повторяется для оставшихся кубов снова и снова. С каждой итерацией структура становится всё более пористой, что и делает её похожей на губку."
}, {
  "Author" : "Keep_lookout",
  "Name" : "Как развлечься с моделями, если хочется чего-то необычного",
  "Realise" : "Sat Jan 25 09:21:55 MSK 2025",
  "TimeToRead" : "14 мин",
  "Views" : "447",
  "ImgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/a03/d98/706/a03d9870658bed3187786724f81d3750.jpg",
  "Rubriks" : [ "Машинное обучение*", "Искусственный интеллект", "Программирование*" ],
  "Prehedder" : "Написать эту статью меня побудило серьезное научное исследование, которое обосновало прекрасный и оригинальный метод Chain of Code (CoC) улучшения рассуждений моделей и точности их ответов. Суть метода заключается в том, чтобы заставить модель написать подходящий программный код, соответствующий поставленной в промпте задаче, интерпретировать его выполнение и на основе полученного результата сформировать более логичный, точный и достоверный ответ. Метод особенно хорошо работает в логических и математических задачах и я считаю, что он заслуживает пристального внимания программистов, как оригинальный и эффективный подход к решению различных хорошо структурированных задач. Я решил продемонстрировать его работу, но так, чтобы было интересно и не скучно. Поэтому предлагаю развлечься с моделями, а поскольку для нашей цели одной будет маловато, то давайте сразу с тремя."
}, {
  "Author" : "Bright_Translate",
  "Name" : "Элегантная математика фильтров Блума",
  "Realise" : "Sat Jan 25 09:13:00 MSK 2025",
  "TimeToRead" : "7 мин",
  "Views" : "750",
  "ImgAddress" : "",
  "Rubriks" : [ "Блог компании RUVDS.com", "Big Data*", "Алгоритмы*", "Математика*" ],
  "Prehedder" : ""
}, {
  "Author" : "shevchenko_a_d",
  "Name" : "Медианы чисел",
  "Realise" : "Sat Jan 25 08:42:19 MSK 2025",
  "TimeToRead" : "3 мин",
  "Views" : "431",
  "ImgAddress" : "",
  "Rubriks" : [ "C++*", "Алгоритмы*" ],
  "Prehedder" : ""
}, {
  "Author" : "integralik",
  "Name" : "Базовое программирование, или Почему джуны не могут пройти к нам собеседование",
  "Realise" : "Sat Jan 25 08:24:45 MSK 2025",
  "TimeToRead" : "8 мин",
  "Views" : "4.4K",
  "ImgAddress" : "",
  "Rubriks" : [ "JavaScript*", "PHP*", "Карьера в IT-индустрии" ],
  "Prehedder" : ""
}, {
  "Author" : "igor_zvyagin",
  "Name" : "Как вырваться из матрицы? Мнение программиста",
  "Realise" : "Sat Jan 25 08:09:03 MSK 2025",
  "TimeToRead" : "8 мин",
  "Views" : "807",
  "ImgAddress" : "https://habrastorage.org/r/w780/getpro/habr/upload_files/2c7/d26/f3c/2c7d26f3cbe1a276324df9a1edaec2fc.jpeg",
  "Rubriks" : [ "Чулан" ],
  "Prehedder" : "Некоторое время назад возмутил Хабр статьей про то, что убежден - мы находимся в симуляции. Было много как позитивных, так и негативных отзывов. Статью даже пытались заблокировать, (возможно, из-за вмешательства «администраторов Матрицы»), вторую часть, так и не пропустили. Было много вопросов, в чем смысл симуляции, если она действительно существует. Другими словами, в чем смысл жизни? Позволю себе посветить в определенную сторону, на то, что уже на виду, на то, что уже происходит. Как мне кажется, мы с вами на пороге создания собственной симуляции. Может не с технической точки зрения, но запрос на создание симуляции уже витает в воздухе."
}, {
  "Author" : "OldfagGamer",
  "Name" : "Ностальгические игры: Far Cry",
  "Realise" : "Sat Jan 25 07:05:29 MSK 2025",
  "TimeToRead" : "14 мин",
  "Views" : "1.9K",
  "ImgAddress" : "",
  "Rubriks" : [ "Блог компании Timeweb Cloud", "Игры и игровые консоли", "Разработка игр*", "Читальный зал" ],
  "Prehedder" : ""
} ]